{
  "blocks": [
    {
      "key": "fqp81",
      "text": "I will never forget the day my family got cut off from the Internet. I was hiding in my room as I usually did after school let out, holed up with a laptop I'd bought third-hand and that I nursed to health with parts from here and there and a lot of cursing and sweat.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7hpav",
      "text": "But that day, my little lappie was humming along, and I was humming with it, because I was about to take away Scot Colford's virginity.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2q3l2",
      "text": "You know Scot Colford, of course. They've been watching him on telly and at the cinema since my mum was a girl, and he'd been dead for a year at that point. But dead or not, I was still going to take poor little Scoty's virginity, and I was going to use Monalisa Fiore-Oglethorpe to do it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "70bf0",
      "text": "You probably didn't know that Scot and Monalisa did a love-scene together, did you? It was over fifty years ago, when they were both teen heart-throbs, and they were co-stars in a genuinely terrible straight-to-net film called No Hope, about a pair of clean cut youngsters who fall in love despite their class differences. It was a real weeper, and the supporting appearances in roles as dad, mum, best mate, priest, teacher, etc, were so forgettable that they could probably be used as treatment for erasing traumatic memories.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 227, "length": 8, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fvalr",
      "text": "But Scot and Monalisa, they had chemistry (and truth be told, Monalisa had geography, too -- hills and valleys and that). They smoldered at one another the way only teenagers can, juicy with hormones and gagging to get their newly hairy bits into play. Adults like to pretend that sex is something that begins at eighteen, but Romeo and Juliet were, like, thirteen.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 32, "length": 9, "style": "ITALIC" },
        { "offset": 75, "length": 9, "style": "ITALIC" },
        { "offset": 356, "length": 8, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4v9an",
      "text": "Here's something else about Scot and Monalisa: they both used body-doubles for other roles around then (Scot didn't want to get his knob out in a 3D production of Equus, while Monalisa was paranoid about the spots on her back and demanded a double for her role in Bikini Trouble in Little Blackpool). Those body-doubles -- Dan Cohen and Alana Dinova -- were in another film, even stupider than Bikini Trouble, called Summer Heat. And in Summer Heat, they got their hairy bits into serious play.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 264, "length": 34, "style": "ITALIC" },
        { "offset": 361, "length": 7, "style": "ITALIC" },
        { "offset": 394, "length": 14, "style": "ITALIC" },
        { "offset": 417, "length": 11, "style": "ITALIC" },
        { "offset": 437, "length": 11, "style": "ITALIC" },
        { "offset": 481, "length": 7, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f13dm",
      "text": "I'd known about the No Hope/Equus/Bikini Trouble/Summer Heat situation for, like, a year, and had always thought it'd be fun to edit together a little creative virginity-losing scene between Scot and Monalisa, since they were both clearly yearning for it back then (and who knows, maybe they slipped away from their chaperones for a little hide-the-chipolata in an empty trailer!).",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 20, "length": 40, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3an1b",
      "text": "But what got me into motion was the accidental discovery that both Scot and Monalisa had done another job together, ten years earlier, when they were six -- an advert for a birthday-party service in which they chased one another around a suburban middle-class yard with squirt guns, faces covered in cake and ice cream. I found this lovely, lovely bit of video on a torrent tracker out of somewhere in Eastern Europe (Google Translate wouldn't touch it because it was on the piracy list, but RogueTrans said it was written in Ukrainian, but it also couldn't get about half the words, so who can say?).",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 150, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "35l7h",
      "text": "It was this bit of commercial toss that moved me to cut the scene. You see, now I had the missing ingredient, the thing that took my mashup from something trite and obvious to something genuinely moving -- a flashback to happier, carefree times, before all the hairy bits got hairy, before the smoldering began in earnest. The fact that the commercial footage was way way down-rez from the other stuff actually made it better, because it would look like it came from an earlier era, a kind of home-film shakycam feel that I bumped up using a video-effects app I found on yet another dodgy site, this one from Tajikistan or Kyrgyzstan -- one of the stans, anyroad.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 196, "length": 6, "style": "ITALIC" },
        { "offset": 419, "length": 6, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5dqig",
      "text": "So there I was, in my broom-cupboard of a bedroom, headphones screwed in tight against the barking of the dogs next door in the Albertsons' flat, wrists aching from some truly epic mousing, homework alerts piling up around the edge of my screen, when the Knock came at the door.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8rkuf",
      "text": "It was definitely a capital-K Knock, the kind of knock they Foley in for police flicks, with a lot of ominous reverb that cuts off sharply, whang, whang, whang. The thunder of authority on two legs. It even penetrated my headphones, shook all the way down to my balls with the premonition of something awful about to come. I slipped the headphones around my neck, hit the panic-button key-combo that put my lappie into paranoid lockdown, unmounting the encrypted disks and rebooting into a sanitized OS that had a bunch of plausible homework assignments and some innocent messages to my mates (all randomly generated). I assumed that this would work. Hoped it would, anyway. I could edit video like a demon and follow instructions I found on the net as well as anyone, but I confess that I barely knew what all this crypto stuff was, hardly understood how computers themselves worked. Back then, anyway.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "131hd",
      "text": "I crept out into the hallway and peeked around the corner as my mum answered the door.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "98mdg",
      "text": "\"Can I help you?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "42arp",
      "text": "\"Mrs. McCauley?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9fodq",
      "text": "\"Yes?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6q4hj",
      "text": "\"I'm Lawrence Foxton, a Police Community Support Officer here on the estate. I don't think we've met before, have we?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cfaok",
      "text": "Police Community Support Officers: a fake copper. A volunteer policeman who gets to lord his tiny, ridiculous crumb of power over his neighbors, giving orders, enforcing curfews, dragging you off to the real cops for punishment if you refuse to obey him. I knew Larry Foxton because I'd escaped his clutches any number of times, scarpering from the deserted rec with my pals before he could catch up, puffing along under his anti-stab vest and laden belt filled with taser, pepper spray and plastic handcuff straps.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 255, "length": 1, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3vvlj",
      "text": "\"I don't think so, Mr. Foxton.\" Mum had the hard tone in her voice she used when she thought me or Cora were winding her up, a no-nonsense voice that demanded that you get to the point.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bgvh",
      "text": "\"Well, I'm sorry to have to meet you under these circumstances. I'm afraid that I'm here to notify you that your Internet access is being terminated, effective --\" He made a show of looking at the faceplate of his police-issue ruggedised mobile \"-- now. Your address has been used to breach copyright through several acts of illegal downloading. You have been notified of these acts on two separate occasions. The penalty for a third offense is a one-year suspension of network access. You have the right to an appeal. If you choose to appeal, you must present yourself in person at the Bradford magistrates' court in the next fourty-eight hours.\" He hefted a little thermal printer clipped to his belt, tore off a strip of paper, and handed it to her. \"Bring this.\" His tone grew even more official and phony: \"Do you understand and consent to this?\" He turned his chest to face Mum, ostentatiously putting her right in the path of the CCTV in his hat brim and over his breast-pocket.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "euhhp",
      "text": "Mum sagged in the door frame and reached her hand out to steady herself. Her knees buckled the way they did so often, ever since she'd started getting her pains and had to quit her job. \"You're joking,\" she said. \"You can't be serious --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8ndbs",
      "text": "\"Thank you,\" he said. \"Have a nice day.\" He turned on his heel and walked away, little clicking steps like a toy dog, receding into the distance as Mum stood in the doorway, holding the curl of thermal paper, legs shaking.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8s6tj",
      "text": "And that was how we lost our Internet.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2a2o6",
      "text": "\"Anthony!\" she called. \"Anthony!\" she called again.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d5jqa",
      "text": "Dad, holed up in the bedroom, didn't say anything.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c6gv6",
      "text": "\"Anthony!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 1, "length": 8, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "35o1o",
      "text": "\"Hold on, will you? The bloody phone's not working and I'm going to get docked --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "chsag",
      "text": "She wobbled down the hall and flung open the bedroom door. \"Anthony, they've shut off the Internet!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fcpom",
      "text": "I ducked back into my room and cowered, contemplating the magnitude of the vat of shit I had just fallen into. My stupid, stupid obsession with a dead film star had just destroyed my family.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 122, "length": 6, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8bre9",
      "text": "I could hear them shouting through the thin wall. No words, just tones. Mum nearly in tears, Dad going from incomprehension to disbelief to murderous rage.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5r67e",
      "text": "\"Trent!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 1, "length": 6, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4c0f",
      "text": "It was like the scene in Man in the Cellar, the bowel-looseningly frightening Scot slasher film. Scot's in the cupboard, and the murderer has just done in Scot's brother and escaped from the garage where they'd trapped him, and is howling in fury as he thunders down the hallway, and Scot is in that cupboard, rasping breath and eyes so wide they're nearly all whites, and the moment stretches like hot gum on a pavement --",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 25, "length": 17, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "194c",
      "text": "\"Trent!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 1, "length": 6, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "etai5",
      "text": "The door to my room banged open so hard that it sent a pile of books tumbling off my shelf. One of them bounced off my cheekbone, sending me reeling back, head cracking against the tiny, grimy window. I wrapped my head in my hands and pushed myself back into the corner.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "43el5",
      "text": "Dad's big hands grabbed me. He'd been a scrapper when he was my age, a legendary fighter well known to the Bradford coppers. In the years since he'd taken accent training and got his job working the phone, he'd got a bit fat and lost half a step, but in my mind's eye, I still only came up to his knee. He pulled my hands away from my face and pinned them at my sides and looked into my eyes.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dvmho",
      "text": "I'd thought he was angry, and he was, a bit, but when I looked into those eyes, I saw that what I had mistaken for anger was really terror. He was even more scared than I was. Scared that without the net, his job was gone. Scared that without the net, Mum couldn't sign on every week and get her disability. Without the net, my sister Cora wouldn't be able to do her schoolwork.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 132, "length": 6, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1qc9f",
      "text": "\"Trent,\" he said, his chest heaving. \"Trent, what have you done?\" There were tears in his eyes.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e1pq4",
      "text": "I tried to find the words. We all do it, I wanted to say. You do it, I wanted to say. I had to do it, I wanted to say. But what came out, when I opened my mouth, was nothing. Dad's hands tightened on my arms and for a moment, I was sure he was going to beat the hell out of me, really beat me, like you saw some of the others dads do on the estate. But then he let go of me and turned round and stormed out the flat. Mum stood in the door to my room, sagging hard against the door-frame, eyes rimmed with red, mouth pulled down in sorrow and pain. I opened my mouth again, but again, no words came out.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 27, "length": 12, "style": "ITALIC" },
        { "offset": 58, "length": 10, "style": "ITALIC" },
        { "offset": 86, "length": 14, "style": "ITALIC" },
        { "offset": 166, "length": 7, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fejqm",
      "text": "I was sixteen. I didn't have the words to explain why I'd downloaded and kept downloading. Why making the film that was in my head was such an all-consuming obsession. I'd read stories of the great directors -- Hitchcock, Lucas, Smith -- and how they worked their arses off, ruined their health, ruined their family lives, just to get that film out of their head and onto the screen. In my mind, I was one of them, someone who had to get this sodding film out of my skull, like, I was filled with holy fire and it would burn me up if I didn't send it somewhere.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 427, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1t3bc",
      "text": "That had all seemed proper noble and exciting and heroic right up to the point that the fake copper turned up at the flat and took away my family's Internet and ruined our lives. After that, it seemed like a stupid, childish, selfish whim.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "714ld",
      "text": "I didn't come home that night. I sulked around the estate, half-hoping that Mum and Dad would come find me, half-hoping they wouldn't. I couldn't stand the thought of facing them again. First I went and sat under the slide in the playground, where it was all stubs from spliffs and dried out, crumbly dog turds. Then it got cold, so I went to the community center and paid my pound to get in and hid out in the back of the room, watching kids play snooker and table-tennis with unseeing eyes. When they shut that down for the night, I tried to get into a couple of pubs, the kind of all-night places where they weren't so picky about checking ID, but they weren't keen on having obviously underage kids taking up valuable space and not ordering things, and so I ended up wandering the streets of Bradford, the ring-road where the wasted boys and girls howled at one other in a grim parody of merriment, swilling alco-pops and getting into pointless, sloppy fights.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ftj9p",
      "text": "I'd spent my whole life in Bradford, and in broad daylight I felt like the whole city was my manor, no corner of it I didn't know, but in the yellow streetlight and sickly moonglow, I felt like an utter stranger. A scared and very small and defenseless stranger.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9dnio",
      "text": "In the end, I curled up on a bench in Peel Park, hidden under a rattly newspaper, and slept for what felt like ten seconds before a PCSO woke me up with a rough shake and a bright light in my eyes and sent me back to wander the streets. It was coming on dawn then, and I had a deep chill in my bones, and a drip of snot that replaced itself on the tip of my nose every time I wiped it off on my sleeve. I felt like a proper ruin and misery-guts when I finally dragged my arse back home, stuck my key in the lock, and waited for the estate's ancient and cantankerous network to let me into our house.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f4i6l",
      "text": "I tiptoed through the sitting room, headed for my room and my soft and wondrous bed. I was nearly to my door when someone hissed at me from the sofa, making me jump so high I nearly fell over. I whirled and found my sister sitting there. Cora was two years younger than me, and, unlike me, she was brilliant at school, a right square. She brought home test papers covered in checkmarks and smiley-faces, and her teachers often asked her to work with thick students to help them get their grades up. I had shown her how to use my edit-suite when she was only ten, and she was nearly as good an editor as I was. Her homework videos were the stuff of legend.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5puni",
      "text": "At thirteen years old, Cora had been a slightly podgy and awkward girl who dressed like a little kid in shirts that advertised her favorite little bands. But now she was fourteen, and overnight, she'd turned into some kind of actual teenaged girl with round soft bits where you'd expect them, and new clothes that she and her mates made on the youth center's sewing machines from the stuff they had in their wardrobes. She always had some boy or another mooching around after her, spotty specimens who practically dripped hormones on her. It roused some kind of odd brotherly sentiment in me that I hadn't realized was there. By which I mean, I wanted to pound them and tell them that I'd break their legs if they didn't stay away from my baby sister.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "49uf1",
      "text": "In private Cora usually treated me with a kind of big-bro reverence that she'd had when we were little kids, when I was the older one who could do no wrong. In public, of course, I wasn't nearly cool enough to acknowledge, but that was all right, I could understand that. That morning, there was no reverence in her expression; rather, she seethed with loathing.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2tmci",
      "text": "\"Arsehole,\" she said, spitting the word out under her breath.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4h6s0",
      "text": "\"Cora --\" I said, holding my hands up, my arms feeling like they were hung with lead weights. \"Listen --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "sdcs",
      "text": "\"Forget it,\" she said in the same savage, hissing whisper. \"I don't care. You could have at least been smart, used a proxy, cracked someone else's wireless.\" She was right. The neighbors had changed their WiFi password and my favorite proxies had all been blocked by the Great Firewall, and I'd been too lazy to disguise my tracks. \"Now what am I supposed to do? How am I supposed to do my homework? I've got GCSEs soon; what am I supposed to do, study at the library?\" Cora revised every moment she had, odd hours of the morning before the house was awake, late at night after she'd come back from babysitting. Our nearest library closed at 5:30 P.M. and was only open four days a week thanks to the latest round of budget cuts.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 333, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "do1i7",
      "text": "\"I know,\" I said. \"I know. I'll just --\" I waved my hands. I'd got that far a hundred times in the night, I'd just -- Just what? Just apologize to Universal Pictures and Warner Brothers? Call the main switchboard and ask to speak to the head copyright enforcer and grovel for my family's Internet connection? It was ridiculous. Some corporate mucker in California didn't give a rat's arse about my family or its Internet access.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 106, "length": 11, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3f6id",
      "text": "\"You won't do shit,\" she said. She stood up and marched to her room. Before she closed the door, she turned and skewered me on her glare: \"Ever.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ehcpu",
      "text": "I left home two weeks later.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6dcqt",
      "text": "It wasn't the disappointed looks from my old man, the increasing desperation of the whispered conversations he had with Mum whenever finances came up, or the hateful filthies from my adoring little sister.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e0imk",
      "text": "No, it was the film.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "88kr",
      "text": "Specifically, it was the fact that I still wanted to make my film. There's only so much moping in your room that you can do, and eventually I found myself firing up my lappie and turning back to my intricate editing project that had been so rudely interrupted. Before long, I was absolutely engrossed in deflowering Scot Colford. And moments after that, I realized that I needed some more footage to finish the project -- a scene from later in Bikini Trouble when Monalisa was eating an ice cream cone with a sultry, smolder look that would have been perfect for the post-shag moment. Reflexively, I lit up my downloader and made ready to go a-hunting for Monalisa's icecream scene.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 37, "length": 28, "style": "ITALIC" },
        { "offset": 348, "length": 4, "style": "ITALIC" },
        { "offset": 444, "length": 14, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8nmpk",
      "text": "Of course, it didn't work. The network wasn't there any more. As the error message popped up on my screen, all my misery and guilt pressed back in on me. It was like some gigantic weight pressing on my chest and shoulders and face, smothering me, making me feel like the lowest, most awful person on the planet. It literally felt like I was strangling on my own awful emotions, and I sat there, wishing that I could die.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "39s6n",
      "text": "I scrunched my eyes up as tight as I could and whispered the words over and over in my mind: want to die, want to die. If wishing could make you pop your clogs, I would have dropped dead right there in my bedroom, and there they'd have found me, slumped over my keyboard, eyes closed, awful whirling brain finally silent. Then they'd have forgiven me, and they could go back to the council and ask to have the net reconnected and Dad could get his job back and Mum could get her benefits again and poor Cora would be able to graduate with top marks and go on to Oxford or Cambridge, where all the clever clogs and brain-boxes went to meet up with all the other future leaders of Britain.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 93, "length": 24, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c500s",
      "text": "I'd been low before, but never low like that. Never wishing with every cell in my body to die. I found that I'd been holding my breath, and I gasped in and finally realized that even if I didn't die, I couldn't go on living like that. I knew what I had to do.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "11d4d",
      "text": "I had almost a hundred quid saved up in a hollow book I'd made from a copy of Dracula that the local library had thrown away. I'd sliced out a rectangle from the center of each page by hand with our sharpest kitchen knife, then glued the edges together and left it under one of the legs of my bed for two days so that you couldn't tell from either side that there was anything tricky about it. I took it out and pulled my school bag from under the bed and carefully folded three pairs of clean pants, a spare pair of jeans, a warm hoodie, my toothbrush and the stuff I put on my spots, a spool of dental floss, and a little sewing kit Cora had given me one birthday along with a sweet little note about learning to sew my own arsing shirtbuttons. It was amazing how easy it was to pack all this. Somewhere in the back of my mind, I'd always known, I think, that I'd have to pack a small bag and just go. Some part of my subconscious was honest enough with itself to know that I had no place among polite society.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 900, "length": 2, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ck47u",
      "text": "Or maybe I was just another teenaged dramatist, caught up in my own tragedy. Either way, it was clear that my guilty conscience was happy to shut its gob and quit its whining so long as I was in motion and headed for my destiny.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7c72t",
      "text": "No one noticed me go. Dinner had come and gone, and, as usual, I'd stayed away from the family through it, sneaking out after all the dishes had been cleared away to poach something from the cupboard. Mum was gamely still cooking dinners, though increasingly they consisted of whatever was on deepest discount at Iceland or something from the local church soup kitchen. She'd brought home an entire case of lethally salted ramen noodles in bright Cambodian packaging and kept trying to dress them up with slices of boiled eggs or bits of cheapest mince formed into half-hearted, fatty meatballs.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6d89f",
      "text": "If they missed me at dinner, they never let on. I'd boil a cup of water and make plain noodles in my room and wash the cup and put it on the draining board while they watched telly in the sitting room. Cora rarely made it to dinner, too, but she wasn't hiding in her room; she was over at some mate's place, scrounging free Internet through a dodgy network bridge (none of the family's devices had network cards registered to work on the estate network, so the only way to get online was to install illegal software on a friend's machine and cable it to ours and pray that the net-gods didn't figure out what we were up to).",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5go74",
      "text": "And so no one heard me go as I snuck out the door and headed for the bus station. I stopped at a news-agent's by the station and bought a new pay-as-you-go SIM for cash, chucking the old one in thre different bins after slicing it up with the tough little scissors from the sewing kit. Then I bought a coach ticket to London Victoria Terminal. I knew Victoria a bit, from a school trip once, and a family visit the summer before. I remembered it as bustling and humming and huge and exciting, and that was the image I had in my head as I settled into my seat, next to an old woman with a sniffle and a prim copy of the Bible that she read with a finger that traced the lines as she moved her lips and whispered the words.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "643eg",
      "text": "The coach had a slow wireless link and there were mains outlets under the seats. I plugged in my lappie and got on the wireless, using a prepaid Visa card I'd bought from the same news-agent's shop, having given my favorite nom-de-guerre, Cecil B. DeVil. It's a tribute to Cecil B DeMille, a great and awful director, the first superstar director, a man who's name was once synonymous with film itself. The trip to London flew by as I lost myself in deflowering poor old Scot, grabbing my missing footage through a proxy in Tehran that wasn't too fussed about copyright (though it was a lot pickier about porn sites and anything likely to cause offense to your average mullah).",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 239, "length": 15, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1psa8",
      "text": "By the time the coach pulled into Victoria, my scene was perfect. I mean perfect with blinking lights and a joyful tune P-E-R-F-E-C-T. All two minutes, twenty-five seconds' worth. I didn't have time to upload it to any of the youtubes before the coach stopped, but that was okay. It would keep. I had a warm glow throughout my body, like I'd just drunk some thick hot chocolate on a day when the air was so cold the bogeys froze in your nose.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 57, "length": 7, "style": "ITALIC" },
        { "offset": 73, "length": 7, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6d960",
      "text": "I floated off the coach and into Victoria Station.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1mk2h",
      "text": "And came crashing back down to Earth.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3c2vu",
      "text": "The last time I'd been in the station, it had been filled with morning commuters rushing about, kids in school blazers and caps shouting and running, a few stern bobbies looking on with their ridiculous, enormous helmets that always made me think of a huge, looming cock, one that bristled with little lenses that stared around in all directions at once.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8ipe3",
      "text": "But as we pulled in, a little after 9:00 P.M. on a Wednesday, rain shitting down around us in fat, dirty drops, Victoria Station was a very different place. It was nearly empty, and the people that were there seemed a lot... grimmer. They had proper moody faces on, the ones that weren't openly hostile, like the beardie weirdie in an old raincoat who shot me a look of pure hatred and mouthed something angry at me. The coppers didn't look friendly and ridiculous -- they were flinty-eyed and suspicious, and as I passed two of them, they followed me with their gaze and the tilt of their bodies.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7qtj3",
      "text": "And I stood there in that high-ceilinged concourse, surrounded by the mutters and farts of the night people and the night trains, and realized that I hadn't the slightest pissing idea what to do next.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "69fer",
      "text": "What to do next. I wandered around the station a bit, bought myself a hot chocolate (it didn't make the warm feeling come back), stared aimlessly at my phone. What I should have done, I knew, was buy a ticket back home and get back on a bus and forget this whole business. But that's not what I did.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 166, "length": 6, "style": "ITALIC" },
        { "offset": 209, "length": 4, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "at14p",
      "text": "Instead, I set off for London. Real London. Roaring, nighttime London, as I'd seen it in a thousand films and TV shows and Internet vids, the London where glittering people and glittering lights passed one another as black cabs snuffled through the streets chased by handsome boys and beautiful girls on bikes or scooters. That London.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 31, "length": 4, "style": "ITALIC" },
        { "offset": 323, "length": 4, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9hoq6",
      "text": "I started in Leicester Square. My phone's map thought it knew a pretty good way of getting there in twenty minutes' walk, but it wanted me to walk on all the main roads where the passing cars on the rainy tarmac made so much noise I couldn't even hear myself think. So I took myself on my own route, on the cobbeldy-wobbeldy side-streets and alleys that looked like they had in the time of King Edward and Queen Victoria, except for the strange growths of satellite dishes rudely bolted to their sides, all facing the same direction, like a crowd of round idiot faces all baffled by the same distant phenomenon in the night sky.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9goen",
      "text": "Just then, in the narrow, wet streets with my springy-soled boots bounding me down the pavement, the London-beat shushing through the nearby main roads, everything I owned on my back -- it felt like the opening credits of a film. The film of Trent McCauley's life, starring Trent McCauley as Trent McCauley, with special guest stars Trent McCauley and Trent McCauley and maybe a surprise cameo from Scot Colford as the worshipful sidekick. And then the big opening shot, wending my way up a dingy road between Trafalgar Square and into Leicester Square in full tilt.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4hodu",
      "text": "Every light was lit. Every square meter of ground had at least four people stood on it, and nearly everyone was either laughing, smoking a gigantic spliff, shouting drunkenly, or holding a signboard advertising something dubious, cheap, and urgent. Some were doing all these things. The men were dressed like gangsters out of a film. The women looked like soft-core porn stars or runway models, with lots of wet fabric clinging to curves that would have put Monalisa to shame.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6thpd",
      "text": "I stood at the edge of it for a moment, like a swimmer about to jump into a pool. Then, I jumped.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e5b0v",
      "text": "I just pushed my way in, bouncing back and forth like a rubber ball in a room that was all corners and trampolines. Someone handed me a spliff -- an older guy with eyes like a baboon's arse, horny fingernails yellow and thick -- and I sucked up a double lungful of fragrant skunk, the crackle of the paper somehow loud over the sound of a million conversations and raindrops. The end was soggy with the slobber of any number of strangers and I passed it on to a pair of girls in glittering pink bowler hats and angel wings, wearing huge \"Hen Night\" badges to one side of their deep cleavage. One kissed me on the cheek, drunken fumes and a bit of tongue, and I reeled away, drunk on glorious! London!",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ds55q",
      "text": "A film kicked out and spilled eight hundred more people into the night, holding huge cups of fizzy drink, wafting the smells of aftershave and perfume into the evenings. The tramps descended on them like flies, and they scattered coins like royalty before peasants. They were all talking films, films, films. The marquee said they'd been to see That Time We All Got Stupid and How Much Fun It Was, Wasn't It? (the latest and most extreme example of the ridiculous trend to extra-long film titles). I'd heard good things about it, downloaded the first twenty minutes after it played the festival circuit last year, and would have given anything to fall in alongside of those chattering people and join the chatter.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 635, "length": 8, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6mhpc",
      "text": "But it was a wet night, and they were hurrying for the road, hurrying to get in cabs and get out of the wet, and the next show let in, and soon the square was nearly empty -- just tramps, coppers, men with signboards...and me.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fv3qu",
      "text": "The opening credits had run, the big first scene had concluded, the camera was zooming in on our hero, and he was about to do something heroic and decisive, something that would take him on his first step to destiny.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9gkqe",
      "text": "Only I had no bloody clue what that step might be.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9vndv",
      "text": "I didn't sleep at all that night. I made my way to Soho, where the clubs were still heaving and disgorging happy people, and I hung about on their periphery until 3:00 A.M. I ducked into a few all-night cafes to use the toilet and get warm, pretending to be part of larger groups so that no one asked me to buy anything. Then the Soho crowds fell away. I knew that somewhere in London there were all-night parties going on, but I had no idea how to find them. Without the crowds for camouflage, I felt like I was wearing a neon sign that read \"I am new in town, underage, carrying cash, physically defenseless, and easily tricked. Please take advantage of me.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "aq9td",
      "text": "As I walked the streets, faces leered out of the dark at me, hissing offers of drugs or sex, or just hissing, \"Come here, come here, see what I've got.\" I didn't want to see what they had. To be totally honest, I wanted my mum.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8j8o1",
      "text": "Finally, the sun came up, and morning joggers and dog-walkers began to appear on the pavements. Bleary-eyed dads pushed past me with prams that let out the cries of sleepless babies. I had a legless, drunken feeling as I walked down Oxford Street, heading west with the sun rising behind me and my shadow stretching before me as long as a pipe-cleaner man.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "88jgr",
      "text": "I found myself in Hyde Park at the Marble Arch end, and now there were more joggers, and cyclists, and little kids kicking around a football wearing trackies and shorts and puffing out clouds of condensation in the frigid morning. I sat down on the sidelines in the damp grass next to a little group of wary parents and watched the ball roll from kid to kid, listened to the happy sounds as they knackered themselves out. The sun got higher and warmed my face, and I made a pillow of my jacket and my pack and leaned back and let my eyes close and the warmth dry out the long night. My mind was whirling a thousand miles per hour, trying to figure out where I'd go and what I'd do now that I'd come to the big city. But sleep wouldn't be put off by panic, and my tired, tired body insisted on rest, and before I knew it, I'd gone to sleep.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1q2m8",
      "text": "It was a wonderful, sweet-scented sleep, broken up with the sounds of happy people passing by and playing, dogs barking and chasing balls, kids messing around in the grass, buses and taxis belching in the distance. And when I woke, I just lay there basking in the wonder and beauty of it all. I was in London, I was young, I was no longer a danger to my family. I was on the adventure of my life. It was all going to be all right.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "b57i6",
      "text": "And that's when I noticed that someone had stolen my rucksack out from under my head while I slept, taking my laptop, my spare clothes, my toothbrush -- everything.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    }
  ],
  "entityMap": {}
}
