{
  "blocks": [
    {
      "key": "fqp81",
      "text": "My \"adventure\" wasn't much fun after that. I was smart enough to find a shelter for runaways run by a church in Shoreditch, and I checked myself in that night, lying and saying I was eighteen. I was worried that they'd send me home if I said I was sixteen. I'm pretty sure the old dear behind the counter knew that I was lying, but she didn't seem to mind. She had a strong Yorkshire accent that managed to be stern and affectionate at the same time.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1lrb2",
      "text": "My bedfellows in the shelter -- all boys, girls were kept in a separate place -- ranged from terrifying to terrified. Some were proper hard men, all gangster talk about knives and beatings and that. Some were even younger looking than me, with haunted eyes and quick flinches whenever anyone spoke too loud. We slept eight to a room, in bunk beds that were barely wide enough to contain my skinny shoulders, and the next day, another old dear let me pick out some clothes and a backpack from mountains of donated stuff. The clothes were actually pretty good. Better, in fact, than the clothes I'd arrived in London wearing; Bradford was a good five years behind the bleeding edge of fashion you saw on the streets of Shoreditch, so these last-year's castoffs were smarter than anything I'd ever owned.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ef54a",
      "text": "They fed me a tasteless but filling breakfast of porridge and greasy bacon that sat in my stomach like a rock after they kicked me out into the streets. It was 8:00 A.M. and everyone was marching for the tube to go to work, or queuing up for the buses, and it seemed like I was the only one with nowhere to go. I still had about forty pounds in my pocket, but that wouldn't go very far in the posh coffee bars of Shoreditch, where even a black coffee cost three quid. And I didn't have a laptop anymore (every time I thought of my lost video, never to be uploaded to a youtube, gone forever, my heart cramped up in my chest).",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "du7fk",
      "text": "I watched the people streaming down into Old Street Station, clattering down the stairs, dodging the men trying to hand them free newspapers (I got one of each to read later), and stepping around the tramps who rattled their cups at them, striving to puncture the goggled, headphoned solitude and impinge upon their consciousness. They were largely unsuccessful.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "b9epv",
      "text": "I thought dismally that I would probably have to join them soon. I had never had a real job and I didn't think the nice people with the posh film companies in Soho were looking to hire a plucky, underage video editor with a thick northern accent and someone else's clothes on his back. How the crapping hell did all those tramps earn a living? Hundreds of people had gone by and not a one of them had given a penny, as far as I could tell.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "61aqe",
      "text": "Then, without warning, they scattered, melting into the crowds and vanishing into the streets. A moment later, a flock of Community Support Police Officers in bright yellow high-visibility vests swaggered out of each of the station's exits, each swiveling slowly so that the cameras around their bodies got a good look at the street.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "es2go",
      "text": "I sighed and slumped. Begging was hard enough to contemplate. But begging and being on the run from the cops all the time? It was too miserable to even think about.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 74, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4d6b3",
      "text": "The PCSOs disappeared into the distance, ducking into the Starbucks or getting on buses, and the tramps trickled back from their hidey holes. A new lad stationed himself at the bottom of the stairwell where I was standing, a huge grin plastered on his face, framed by a three-day beard that was somehow rakish instead of sad. He had a sign drawn on a large sheet of white cardboard, with several things glued or duct-taped to it: a box of kleenex, a pump-handled hand-sanitizer, a tray of breath-mints with a little single-serving lever that dropped one into your hand. Above them was written, in big, friendly graffiti letters, FREE TISSUE/SANITIZER/MINTS -- HELP THE HOMELESS -- FANKS, GUV!, and next to that, a cup that rattled from all the pound coins in it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3h7kt",
      "text": "As commuters pelted out of the station and headed for the stairs, they'd stop and read his sign, laugh, drop a pound in his cup, take a squirt of sanitizer or a kleenex or a mint (he'd urge them to do if it seemed they were in danger of passing by without helping themselves), laugh again, and head upstairs.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cbknt",
      "text": "I thought I was being subtle and nearly invisible, skulking at the top of the stairwell and watching, but at the next break in the commuter traffic, he looked square at me and gave me a \"Come here\" gesture. Caught, I made my way to him. He stuck his hand out.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7gfvv",
      "text": "\"Jem,\" he said. \"Gentleman of leisure and lover of fine food and laughter. Pleased to make your acquaintance, guv.\" He said it in a broad, comic cockney accent and even tugged at an invisible cap brim as he said it. I laughed.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3k88r",
      "text": "\"Trent McCauley,\" I said. I tried to think of something as cool as \"gentleman of leisure\" to add, but all I came up with was \"Cinema aficionado and inveterate pirate,\" which sounded a lot better in my head than it did in the London air, but he smiled back at me.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ckc21",
      "text": "\"Trent,\" he said. \"Saw you at the shelter last night. Let me guess. First night, yeah?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8vdh0",
      "text": "\"In the shelter? Yeah.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "52ki2",
      "text": "\"In the world, son. Forgive me for saying so, but you have the look of someone who's just got off a bus from the arse end of East Shitshire with a hat full of dreams, a pocketful of hope, and a head full of strawberry jam. Have I got that right?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 8, "length": 5, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cpnda",
      "text": "I felt a little jet of resentment, but I had to concede the point. \"Technically I've been here for two days,\" I said. \"Last night was my first night in the shelter.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 99, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3rp2b",
      "text": "He winked. \"Spent the first night wandering the glittering streets of London, didn't ya?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4k117",
      "text": "I shook my head. \"You certainly seem to know a lot about me.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fc39l",
      "text": "\"Mate,\" he said, and he lost the cockney accent and came across pure north, like he'd been raised on the next estate. \"I am you. I was you, anyway. A few years ago. Now I'm the Jammie Dodger, Prince of the London Byways, Count of the Canalsides, Squire of the Squat, and so on and so on.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 121, "length": 2, "style": "ITALIC" },
        { "offset": 131, "length": 3, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "73dt5",
      "text": "Another train had come in, and more people were coming out of the station. He shooed me off to one side and began his smiling come-ons to the new arrivals. A minute later, he'd collected another twelve quid and he waved me back over.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cd91q",
      "text": "\"Now, Master McCauley, you may be wondering why I called you over here.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6hrdb",
      "text": "I found his chirpy mode of speech impossible to resist, so I went with it. \"Indeed I am, Mr. Dodger. Wondering that very thing, I was.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1b8nl",
      "text": "He nodded encouragement, pleased that I was going along with the wheeze. \"Right. Well, you saw all the other sorry sods holding up signs in this station, I take it?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "784bo",
      "text": "I nodded.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "806sh",
      "text": "\"None of 'em is making a penny. None of 'em know how to make a penny. That's cos most of the people who end up here get here because something awful's gone wrong with them and they don't have the cunning and fortitude to roll with it. Mostly, people end up holding a sign and shaking a cup because someone's done them over terribly -- raped them, beat them up, given them awful head-drugs -- and they don't have the education, skills or sanity to work out how to do any better.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 49, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8mlt8",
      "text": "\"Now, me, I'm here because I am a gentleman of leisure, as I believe I have informed you already. Whatever happened in my past, I was clever and quick and tricksy enough to deal with it. So when I landed up holding a sign in a tube station hoping for the average Londoner to open his wallet and his heart to buy my supper, I didn't just find any old sheet of brown cardboard box, scrawl a pathetic message on it, and hope for the best.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4gu5g",
      "text": "\"No. I went out and bought all different kinds of card -- bright yellow, pink, blue, plain white -- and tested each one. See?\" He reached into the back pocket of his jeans and drew out a small, worn notebook. He opened it to the first page and stuck it under my nose. It was headed \"Colors: (HELP THE HOMELESS)\" and there were two columns running its length, one listing different colored cardboards, the other showing different amounts.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2rj7",
      "text": "\"Look at that, would you? See how poorly brown performs? It's the bottom of the barrel. People just don't want to open their wallets to a man holding a sign that looks like it was made out of an old cardboard box. You'd think they would, right? Appearance of deserving thrift an' all? But they don't. They like practically any color except brown. And the best one, well, it's good old white.\" He rattled his sign. \"Lots of contrast, looks clean. I buy a new one every day down at the art supply shop in Shoreditch High Street. The punters like a man what takes pride in his sign.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 333, "length": 6, "style": "ITALIC" },
        { "offset": 561, "length": 5, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "evi6f",
      "text": "Another tubeload of passengers came up, and he shooed me off again, making another twenty-some pounds in just a few minutes. \"Now, as to wording, just have a look.\" He showed me the subsequent pages of his book. Each had a different header: HOMELESS - HELP. HUNGRY - HELP. HELP THE HUNGRY. HELP THE HOMELESS. DESPERATE. DESPERATE - HELP. \"What I noticed was, people really respond to a call for action. It's not enough to say, 'homeless, miserable, starving' and so on. You need to cap it off with a request of some kind, so they know what you're after. HELP THE HOMELESS outperforms everything else I've tried. Simple, to the point.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 373, "length": 7, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a06qc",
      "text": "He flipped more pages, and now I was looking at charts showing all the different things he'd given away with his signboard, and the combinations he'd tried. \"You gave away liverwurst?\" I stared at the page.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 172, "length": 10, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "51at6",
      "text": "\"Well, no,\" he said. \"But I tried. Turns out no one wants to accept a cracker and liver-paste from a tramp in a tube station.\" He shrugged. \"It wasn't a great idea. I ended up eating liverwurst for three days. But it didn't cost me much to try and fail. If you want to double your success rate, triple your failure rate. That's what I always say. And sometimes, you've just got to be crazy about it. Every time I go into a shop, I'm on the lookout for something else I can do. See this?\" He held up a tiny screwdriver. \"Eyeglass tightener. You wait until sunglasses season, I'm going to be minted. FREE DIY SPECTACLE REPAIR. HELP THE HOMELESS.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 590, "length": 6, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "908ec",
      "text": "\"Why are you telling me all this?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9h4s8",
      "text": "He shrugged again. \"I tell anyone who'll listen, to be honest. Breaks my heart to see those poor sods going hungry. And you seemed like you were fresh off the boat, like you probably needed a little help.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4c0pe",
      "text": "\"So you think I should go make a sign like yours?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fftlv",
      "text": "He nodded. \"Why not? But this is just a way to get a little ready cash when I need it.\" He carefully rolled up the signboard, emptying his cup into his front pocket, which bulged from the serious weight of an unthinkable quantity of pound and two-pound coins. \"Hop it, I'll buy you a coffee.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "brg58",
      "text": "He walked us past the Starbucks and up Old Street to Shoreditch High Street, then down a small alley, to a tiny espresso stand set in the doorway of an office building. The man who ran it was ancient, with arthritic, knobby fingers and knuckles like walnuts. He accepted two pound coins from Jem and set about making us two lattes, pulling the espresso shots from a tarnished machine that looked even older than he did. The espresso ran out of the basket and into the paper cup in a golden stream and he frothed the milk with a kind of even, unconscious swirling gesture, then combined the two with a steady hand. He handed them to us, wordlessly, then shooed us off.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "28brg",
      "text": "\"Fyodor makes the best espresso in east London,\" Jem said, as he brought his cup to his lips and sipped. He closed his eyes for a second, then swallowed and opened them, wiping at the foam on his lip with the back of his hand. \"Had his own shop years ago, went into retirement, got bored, set up that stand. Likes to keep his hand in. Practically no one knows about him. He's kind of a secret. So don't go telling all your mates, all right? Once Vice gets wind of that place, it'll be mobbed with awful Shoreditch fashion-victims. I've seen it happen. Fyodor wouldn't be able to take it. It'd kill him. Promise me.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 446, "length": 4, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9m0uc",
      "text": "\"I promise.\" I was really starting to enjoy his overblown, dramatic way of speaking. \"On my life I doth swear it,\" I said. I didn't mention that the only coffee I'd ever drunk was Nescafé.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d8rcq",
      "text": "\"You're overdoing it,\" he said. \"You were doing okay until you got to 'doth.'\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d3r3n",
      "text": "\"Noted,\" I said. Personally, I liked 'doth.'",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f2iop",
      "text": "\"Here's the thing,\" he said. \"Most of the poor bastards who end up on the street never really think it through. It's not a surprise, really. Like I said, people usually get here as the result of some awful trauma, and once they're on the road, it's hard to catch your breath and get some perspective. So nothing against them, but there's a smart way to be homeless and a stupid way. Do you want to learn about the smart way?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c2vi3",
      "text": "I had a pang of suspicion just then. I didn't know this person. I hadn't even noticed him in the shelter (but then, I'd spent my time there trying not to inadvertently provoke any of the boys with eye contact, especially the ones talking about their knives and fights). Everything I knew about being homeless I'd learned from lurid Daily Mail cover stories about poor tramps and runaway kids who'd been cut up, fouled, and left in pieces in rubbish bins all over England.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 332, "length": 10, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d0qm1",
      "text": "One word kept going round my head: \"Groomer.\" Supposedly, there was an army of groomers out there, men and women and even kids who tried to get vulnerable teens (like me, I suppose) to involve themselves with some dirty, ghastly pedophile scheme. These, too, featured prominently in the screaming headlines of the Daily Mail and the Sun, and we had an annual mandatory lecture on \"network safety\" that was all about these characters. I didn't really believe in them, of course. Trying to find random kids to abuse on the net made about as much sense as calling random phone numbers until you got a child of your preferred age and sex and asking if she or he wanted to come over and touch your monkey.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 314, "length": 10, "style": "ITALIC" },
        { "offset": 333, "length": 4, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "abc23",
      "text": "I'd pointed this out once at school, right after the teacher finished showing us a slide that showed that practically every kid that was abused was abused by a family member, a teacher or some other trusted adult. \"Doesn't that slide mean that we should be spending all our time worrying about you, not some stranger on the net?\" I'd got a week's detention.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cehd1",
      "text": "But it's one thing to be brave and sensible at school; another thing to be ever-so-smart and brave as you're standing on a London street with less than thirty quid to your name, a runaway in a strange city with some smart-arse offering to show you the ropes.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "aqb1q",
      "text": "\"You're not going to cut me up and leave me in a lot of rubbish bins all over England are you?\" I said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a8b8u",
      "text": "He shook his head. \"No, too messy. I'm more the cement-block-around-the-ankles-heave-ho-into-the-Thames sort. The eels'll skeltonize you inside of a month. I'll take your teeth so they can't do the dental records thing.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "541ei",
      "text": "\"I confess that I don't know what to say to that.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ad702",
      "text": "He slapped me on the shoulder. \"Don't be daft, son. Look, I promise I won't take you inside any secluded potential murder sites. This is the Jammie Dodger's tour of London, admission free. It's better than the Ripper tour, better than one of them blue disk walking tours, better than a pub crawl. When you're done with the Jammie Dodger tour, you've got knowledge you can use. What say you, stout fellow?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1mc1h",
      "text": "\"You're overdoing it,\" I said. \"You were doing okay until you got to 'stout fellow.'\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ani3e",
      "text": "\"It's a fair cop,\" he said. \"Come on.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3kujr",
      "text": "Our first stop was a Waitrose supermarket in the Barbican. It was a huge place, oozing poshness out into the street. Mums with high-tech push-chairs and well-preserved oldies cruised in and out, along with the occasional sharp-dressed man in a suit. Jem led me through the front door and told me to get a trolley. I did, noting that it had a working checkout screen on it -- all the ones back home were perpetually broken.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "82vem",
      "text": "As I pushed it over to him in the produce section, one of the security guards -- cheap suit, bad hair, conspicuous earphone -- detached himself from the wall and drifted over to us. He hung back short of actually approaching us, but made no secret of the fact that he was watching us. Jem didn't seem to mind. He walked us straight into the fruit section, where there were ranks of carefully groomed berries and succulent delights from around the world, the packages cleverly displaying each to its best effect. I'd never seen fruit like this: it was like hyper-fruit, like the fruit from films. The carton of blackberries didn't have a single squashed or otherwise odd-shaped one. The strawberries were so perfect they looked like they'd been cast from PVC.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cln4o",
      "text": "Jem picked up one of each and waved it at the cart so that one of its thousands of optical sensors could identify it and add the total to a screen set into the handle. I boggled. The strawberries alone cost twelve pounds! The handle suggested some clotted cream and buns to go with them. It offered to e-mail me a recipe for strawberry shortcake. I merely goggled at the price. Jem didn't mind. He gaily capered through the store, getting some rare pig-gall-bladder pate (\"An English Heritage Offal Classic\") for fifteen pounds; a Meltingly Lovely Chocolate Fondant (twelve pounds for a bare mouthful); hunnerwurst-style tofu wieners (six pounds); Swiss Luxury Bircher Muesli (twenty-two pounds! For a tiny bag of breakfast cereal!). The screen between my hands on the handle stood at over two hundred pounds before he drew up short, a dramatic and pensive finger on his chin.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8qlaj",
      "text": "I had a sinking feeling. He was going to steal something. I knew that he was going to steal something. Of course he was going to steal something -- everyone knew it. The other shoppers knew it. The security guard certainly knew it. There were hundreds of cameras on the trolley to make it easier to scan your groceries, each one no larger than a match-head. I didn't care how experienced and sophisticated this guy was, he was about to get us both arrested.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 106, "length": 6, "style": "ITALIC" },
        { "offset": 213, "length": 9, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6huhg",
      "text": "But then he patted down his pockets, then said, in a showy voice, \"Dearie me, forgot my wallet.\" He took the cart out of my hands and wheeled it to the security guard. \"Take this, would you, mate?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8ai3g",
      "text": "And then he left so quickly I almost didn't catch up with him. He was giggling maniacally. I grabbed his shoulder. \"What the hell was that all about?\" I said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bk8mo",
      "text": "He shook my hand off. \"Easy there, old son. Watch and learn.\" He led me around the back of the shop, where two big skips -- what they called \"Dumpsters\" in American films -- sat, covered in safety warnings and looking slightly scary. Without pausing, Jem flipped up the lid of the first one. He peered inside. A funky, slightly off smell wafted to me, like the crisper drawer of a fridge where a cucumber's been forgot for too long.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "665su",
      "text": "\"Here we go,\" he said. \"Go get us some of those boxes, yeah?\" There were stacks of flattened cardboard boxes beside the skips. I brought a bale over to him and he wrestled them free of the steel strap that tied them tight. \"Assemble a couple of them,\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "nm5r",
      "text": "I did as bade, and he began to hand me out neatly wrapped food packages, a near item-for-item repeat of the stuff we'd found in the store. Some of it had a little moisture on it or something slimy, but that was all on the wrapping, not on the food.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5n2h0",
      "text": "\"Why is all this in the bin?\" I asked as I packed it into the box.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "24ip8",
      "text": "\"All past the sell-by date,\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9fqf1",
      "text": "\"You mean it's spoiled?\" I'd filled an entire box and was working on another one. I gagged a little at the thought of eating rotting food from the garbage, and I was pretty sure that was what Jem had in mind.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "86cui",
      "text": "\"Naw,\" he said, his voice echoing weirdly off the steel walls of the skip. \"The manufacturers print sell-by dates on the packages because they don't want to get sued if someone eats bad food, so they're very conservative. And of course no one will buy anything at a store that's past its sell-by date. But if you think about it logically, there's no magic event that happens at midnight on sell-by day that makes the cheese go off.\" He handed me a neatly wrapped package of presliced Jarlsberg cheese. \"I mean, cheese is basically spoiled milk already. Yogurt, too!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "57d18",
      "text": "He moved on to the next skip, carefully closing the lid. \"Ooh!\" he said, and handed me a case of gourmet chocolate bars, still sealed. One side of it had been squashed. \"Probably fell off the stock-shelf or got squished in shipping. Those are freaking good, too -- I like the ones with chili in.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f17ra",
      "text": "\"Ooh,\" he said again. \"Bring me boxes, will you? More boxes.\" I went and wrestled another set of cardboard flats off the pile and slipped them out of their band. Jem vaulted the skip's edge and held a hand out. I gave him a box, listened to the sound of things being moved about inside. Then his hand came out again, and I passed him another box. Then another. \"Come see,\" he said, and I stood on tiptoe to peer over the edge.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9vd4e",
      "text": "Jem had used the boxes to make a sort of corridor through the food and other rubbish, like a miner's tunnel, and he was turning over the skip's contents, and he was building a tower of tins in one corner of it. \"I was hoping for this,\" he said. \"Oh, yes.\" He stacked more tins. I peered at the labels. GOURMET COCONUT MILK, the nearest one read. REINDEER MEAT, another read. FILIPINO SARDINES. REFRIED BEANS.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dicq5",
      "text": "\"What's all that?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ckokj",
      "text": "\"That,\" he said, \"is the remains of Global Tradewinds, Ltd. They used to tin the best gourmet delicacies from around the world and sell 'em here. But they went bust last month and all the Waitroses have been taking them off the shelves. I knew I'd find a skip full of their stuff if I waited long enough!\" He rubbed his hands together.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "enecr",
      "text": "\"We're not going to carry all that stuff out of here?\" I said. There were dozens of tins.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "drqmr",
      "text": "\"We certainly are,\" he said. \"Christ, mate, you can't seriously think that I'd let this haul go to waste? It'd be a sin. Hop it, more boxes.\" He snapped his fingers.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4gm2",
      "text": "Shaking my head, I went and got more boxes. He tossed me a roll of packing tape. \"Tape up the bottoms -- they're not going to hold together just from folding, not with all this weight.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1k5b5",
      "text": "\"Where the hell are you going to keep all this junk?\" I said. When I'd started boxing up food, I had a vision of feasting on it, maybe putting the rest in my backpack for a day or two. But this was a month's worth of food, easy.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 33, "length": 4, "style": "ITALIC" },
        { "offset": 200, "length": 5, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3telu",
      "text": "\"Oh, we're not going to keep it, no fear.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f8qtv",
      "text": "In the end, there were eight big boxes full of food, which was about six more than we could easily carry.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8q8mu",
      "text": "\"No worries,\" he said. \"Just form a bucket brigade.\" Which is exactly what we did. I piled up seven boxes and Jem took one down to the end of the block. I picked up another box and walked toward him while he walked back to me. When we met, I gave him the box and he turned on his heel and walked back to the far end, stacking the box on top of the one he'd just put down. Meanwhile, I'd turned round and gone back to my pile, scooping another box. It was a very efficient way of doing things, since neither of us were ever sitting around idle, waiting for the other.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "71sr0",
      "text": "I worried briefly about someone stealing one of the boxes off the piles while they were unattended, but then I realized how stupid that was. These were boxes of rubbish, after all. We'd got them for free out of a skip. We could always find another skip if we needed to.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ejbh",
      "text": "We moved the boxes one entire block in just a few minutes and regrouped. I was a bit winded and sweaty. Jem grinned and windmilled his arms. \"Better than joining a gym,\" he said. \"Only ten more roads that way!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7c1k6",
      "text": "I groaned. \"Where are were taking these sodding things?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a1qgh",
      "text": "He was already moving, hauling another box down the pavement. \"Back to the station,\" he called over his shoulder.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1cqvj",
      "text": "When we got to Old Street Station, he straight away went up to two of the tramps, an elderly couple wearing heavy coats (too heavy for the weather) and guarding bundle-buggies full of junk and clothes. They didn't smell very good, but then again, neither did I at that point, 'cos I'd forgot to pack deodorant in my runaway go-bag.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1aouf",
      "text": "\"Morning Lucy; morning, Fred,\" Jem said, dropping a box at their feet. \"You all right?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "lvfc",
      "text": "\"Can't complain,\" the old lady said. When I looked closer, I saw that she wasn't as old as all that, but she was prematurely aged, made leathery by the streets. She was missing teeth, but she still had a sunny smile. \"Who's the new boy, Jem?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1hu4g",
      "text": "\"Training up an apprentice,\" he said. \"This is Trent. Trent, these are my friends Lucy and Fred.\" I shook their rough, old hands. Lucy's grip was so frail it was like holding a butterfly. Fred grunted and didn't look me in the eye. He had something wrong with him, I could see that now, that weird, inexplicable wrongness that you could sense when you were around someone who was sick in the head somehow. He didn't seem dangerous -- just a bit simple. Or shy. \"Brought you some grub,\" Jem said, and kicked his box.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4no6c",
      "text": "Lucy clapped and said, \"You are such a good boy, Jem.\" She got down on her creaky knees and opened the box, began to carefully paw through the contents, pulling out a few tins, some of the fruit and veg. She exclaimed over a wheel of cheddar and looked up at Jem with a question in her eyes.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "evgl1",
      "text": "\"Go on, go on,\" he said. \"Much as you like. There's more where that came from.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ajjfu",
      "text": "In the end, the two of them relieved us of an entire boxful of food. As they squirreled it away in their bundle-buggies, I felt something enormous and good and warm swell up in my chest. It was the feeling of having done something...good. Something really, really good -- helping people who needed it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a8465",
      "text": "They thanked us loads and we moved on through the station.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "el0ar",
      "text": "\"Do they know that the food comes from a skip?\" I asked, quietly.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fvg2j",
      "text": "Jem shrugged. \"Probably. They never asked.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "33kc8",
      "text": "\"Haven't you taken them to see all the stuff in the skips?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8g256",
      "text": "He snorted. \"Fred and Lucy are two of the broken people I was telling you about. Tried to help 'em with their signs, tried to help 'em learn how to get better food, a decent squat. But it's like talking to a wall. Lucy spent a year in hospital before she ended up out here. Her old man really beat her badly. And Fred... Well, you could see that Fred's not all there.\" He shrugged again. \"Not everyone's able to help themselves.\" He socked me in the shoulder. \"Lucky thing there's us, hey?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cqppk",
      "text": "We came to another tramp, this one much younger and skinny, like the drug addicts I'd seen around the bus station in Bradford. His hands shook as he picked out his tins, and he muttered to himself, but he couldn't thank us enough and shook my hand with both of his.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6463i",
      "text": "One by one, we covered the station exits and the tramps at each one. Jem never tried to keep anyone from taking too much, nor did he keep back the best stuff for himself. By the time we were done, we were down to a single box of food, mostly the odd tinned foreign delicacies. These were the heaviest items in the haul, of course.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3t5sr",
      "text": "\"Come on, then,\" he said. \"Let's have a picnic.\" We walked out of the station and down the road a little way and turned into the gates of a beautiful old cemetery.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9a91l",
      "text": "\"Bunhill,\" he said. \"Originally 'Bone Hill.' It was a plague pit, you see.\" The graveyard was a good meter higher than the pavement in front of it. \"Masses of people killed in the plagues, all shoveled under the dirt. Brings up the grass a treat, as you can see.\" He gestured at the rolling lawns to one side of the ancient, mossy, fenced-in headstones. \"Nonconformist cemetery,\" he went on, leading me deeper. \"Unconsecrated ground. Lots of interesting folks buried here. You got your writers: like John Bunyon who wrote Pilgrims Progress. You got your philosophers, like Thomas Hardy. And some real maths geniuses, like old Thomas Bayes --\" He pointed to a low, mossy tomb. \"He invented a branch of statistics that got built into every spam filter, a couple hundred years after they buried him.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 522, "length": 17, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9gp8m",
      "text": "He sat down on a bench. It was after mid-day now, and only a few people were eating lunch around us, none close enough to overhear us. \"It's a grand life as a gentleman adventurer,\" he said. \"Nothing to do all day but pluck choice morsels out of the bin and read the signboards the local historical society puts up in the graveyard.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5477v",
      "text": "He produced a tin-opener from his coat pocket and dug through the box. \"Here,\" he said. \"You like Mexican refried beans?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "elrf0",
      "text": "\"You mean like from Taco Bell?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "979ni",
      "text": "He shook his head. \"Nothing at all like Taco Bell. Much better than that rubbish.\" Rummaging further in his pockets, he found a small glass bottle of Tabasco sauce. He opened the beans, sprinkled the hot sauce on them, and mashed it in with a bamboo fork he extracted from a neat nylon pouch. He took out another and handed it to me. \"Eat,\" he said. \"We're on a culinary tour of the world!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "aaggp",
      "text": "It wasn't the best meal I've ever eaten, but it was the oddest and the most entertaining. Jem narrated the contents of each tin like the announcer on a cooking show. The stodgy breakfast gruel had finally dissolved in my stomach, leaving me starving hungry, and the unfamiliar flavors went a long way toward filling the gaps. When we were done, there were only two or three tins left, which Jem offered to me. I took a tin of bamboo shoots in fresh water and left the other two for him.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7k62o",
      "text": "He stood and stretched his arms over his head then bent down to touch his toes, straightened and twisted from side to side. \"Right then,\" he said. \"Basic lessons are over. What have you learned, pupil mine?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8giiu",
      "text": "I stood and stretched too. My muscles, already sore from carrying all the food, had cooled and stiffened while we ate, and I groaned as they reluctantly stretched out. \"Erm,\" I said. \"Okay, no brown signs.\" He nodded. \"Don't trust sell-by dates.\" He nodded again. \"Skips are good eating.\" He nodded. \"Well,\" I said. \"That's pretty cool.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "10hh3",
      "text": "\"You're forgetting the most important lesson,\" he said. He shook his head. \"And you were doing so well.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "17k8",
      "text": "I racked my brains. \"I don't know,\" I said. \"What is it?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bon0r",
      "text": "\"You have to come up with it on your own,\" he said. \"Now, what are you going to do next?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "542fr",
      "text": "I shrugged. \"I guess I'll make a sign. I'll find a pitch that's not too close to you, of course. Don't want to cut into your business.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a7fn8",
      "text": "\"I'm not bothered. But beyond that, what are you going to do? Where will you sleep tonight?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9dloi",
      "text": "\"Back at the shelter, I suppose. Beats sleeping in a doorway.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "btktl",
      "text": "He nodded. \"It's better than a doorway, true. But there's better places. Me, I've had my eye on a lovely pub out in Bow. All boarded up, no one's been in for months. Looks cozy, too. Want to come have a look at it with me?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5o20k",
      "text": "\"You're going to break in?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3jni1",
      "text": "\"No,\" he said. \"That's illegal. Going to walk in. Front door's off its hinges.\" He tsked. \"Vandals. What is this world coming to?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 41, "length": 4, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dsftn",
      "text": "\"It's not illegal to walk in?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3trrj",
      "text": "\"Squatter's rights, mate,\" he said. \"I'm going to occupy that derelict structure and beautify it, thus elevating the general timbre of the neighborhood. I'm a force for social good.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f662k",
      "text": "\"But will you get arrested?'",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "66cg9",
      "text": "\"It's not illegal,\" he said. \"Don't worry, mate. You don't have to come, if you don't want to. I just don't like that shelter. It's all right for people who can't do any better, but I always worry that there's someone more desperate than me who can't get a bed 'cos I'm there.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 6, "length": 11, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1nh1",
      "text": "\"Plus those old pubs are just lovely. Hardwood floors, brass fittings, old wainscoting. Estate agent's dream. Just the tile on the outside is enough to break your heart.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d6gi3",
      "text": "He stuck out his hand. \"Nice to have met you, son. I expect we'll run into one another again soon enough.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2k4o3",
      "text": "\"Wait!\" I said. \"I didn't say I wouldn't come!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "88vg2",
      "text": "\"So come, then!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "134j7",
      "text": "We caught a 55 bus from Old Street. He paid my fare, handing over a clatter of pound coins from his jingling pocket. We went upstairs to the upper deck and found a seat, right up front, by the huge picture window.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7c6th",
      "text": "\"The London channel,\" he said, gesturing at the window and the streets of London whizzing past us. \"In high def. Nothing like it. Love this place.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "uvl4",
      "text": "We passed through the streets of Shoreditch and into Bow, which was a lot wilder and less rich. Mixed in among the posh shops were old family shops, bookies, seedy discount shops, and plenty of boarded-up storefronts. The people were a mix of young trendies like you'd see in Shoreditch, old people tottering down the road carrying their shopping, women in Muslim veils with kids in tow, Africans in bright colors chatting away as they walked the streets. It felt a lot more like Bradford, with all the Indians and Pakistanis, than it did like London.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8tneb",
      "text": "We went deeper into Bow, through a few housing estates, past some tower-blocks that were taller than any apartment building I'd ever seen, some of them boarded up all the way to the sky. This was a lot less nice than the high-street we'd just passed down, proper rough. Like home. But it didn't make me homesick.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "b5ae6",
      "text": "\"This is us,\" Jem said, pressing the Stop Request button on the pole by the seat. There was almost no one else left on the bus, and we wobbled down the steps as it braked at a bus stop where all the glass had been broken out, and recently, judging by the glittering cubes of safety glass carpeting the pavement as we got off.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9oio7",
      "text": "We crunched over the glass and I heard a hoot -- like an owl, but I was pretty sure it had come from a human throat -- from off in the distance. There was an answering whistle.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dk9cn",
      "text": "\"Drugs lookouts,\" Jem said. \"They think we might be customers. Don't worry, they won't bother us once they see we're not here for sugar. Just keep walking.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4nttu",
      "text": "He set off across an empty lot that was littered with an old mattress, pieces of cars, trolleys, and blowing, decomposing plastic bags. Across the lot stood a solitary brick building, three stories tall. The side facing us had a ghost-staircase -- the brick supports for a stairwell that once ran up that wall when it was part of the building next door. Looking around, I could see more ghosts: rectangular stone shapes set into the earth, the old foundations for a row of buildings that had once stood here. The pub -- for that's what it was -- was the last building standing, the sole survivor of an entire road that had succumbed to the wrecker's ball.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cv84o",
      "text": "As we drew nearer, Jem stopped and put his hands on his hips. \"Beautiful, innit? Wait'll you see inside. An absolute tip, but it'll scrub up lovely.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a5bnc",
      "text": "We crossed to the building, and Jem entered without stopping. I followed, and my nose was assaulted with the reek of old piss and booze and smoke and shite. It was not a good smell. I gagged a bit, then switched to breathing through my mouth.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fdp7p",
      "text": "Jem, meanwhile, had shucked his backpack and dug out some paper painter's masks. He slipped one over his head and handed the other to me. \"Here,\" he said, a bit muffled. \"We'll take care of the smell soon enough, no worries. But first we have to do something about this door.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "enseb",
      "text": "He produced a hiker's headlamp from his bag and fitted it to his head, switching it on and sending a white beam slicing through the dusty, funky air. He shut the door with a bang, and his torch became the only source of light in the shuttered pub, save for a few chinks around the boards on the windows. I felt a moment's fear. This is where he cuts me up and chucks me in a bin. But he didn't show any interest in cutting me up. Instead, he was peering at the lock. He fitted a screwdriver to it and began to remove the mechanism. I could see that it was bent and broken by some ancient vandal.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 328, "length": 50, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "79jpk",
      "text": "\"Pissing screws have rusted into place,\" he muttered, dipping into his bag for a small plastic bottle with a long, thin nozzle. He dripped liquid onto the screws. \"Penetrating oil,\" he said. \"That'll loosen 'em up.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "m531",
      "text": "\"Jem,\" I said, \"what the hell are you doing?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "67pjq",
      "text": "\"Changing the locks. Got to establish my residency if I'm going to claim this place for my own.\" He reapplied the screwdriver to the door.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dtant",
      "text": "\"You what?\" I said. \"You're going to claim this place? How do you think you'll do that?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "30tvl",
      "text": "\"With one of these,\" he said, and he handed me a folded sheet of paper. I unfolded it in the dark, then held it in the light of his torch so that I could read it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dhv3q",
      "text": "LEGAL WARNING",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a3gqs",
      "text": "Section 6 Criminal Law Act 1977",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cdts1",
      "text": "As amended by Criminal Justice and Public Order Act 1994",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dk4vj",
      "text": "TAKE NOTICE",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "24lek",
      "text": "THAT we live in this property, it is our home and we intend to stay here.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3makv",
      "text": "THAT at all times there is at least one person in this property.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5a99a",
      "text": "THAT any entry or attempt to enter into this property without our permission is a criminal offense as any one of us who is in physical possession is opposed to entry without our permission.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e2g0d",
      "text": "THAT if you attempt to enter by violence or by threatening violence we will prosecute you. You may receive a sentence of up to six months imprisonment and/or a fine of up to £5,000.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5mg5t",
      "text": "THAT if you want to get us out you will have to issue a claim in the County Court or in the High Court, or produce to us a written statement or certificate in terms of S.12A Criminal Law Act, 1977 (as inserted by Criminal Justice and Public Order Act, 1994).",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e5r20",
      "text": "THAT it is an offense under S.12A (8) Criminal Law Act 1977 (as amended) to knowingly make a false statement to obtain a written statement for the purposes of S. 12A. A person guilty of such an offense may receive a sentence of up to six months imprisonment and/or a fine of up to £5,000.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cffh4",
      "text": "Signed",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "agqdf",
      "text": "The Occupiers",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2cogs",
      "text": "I tried to get my head around the note. \"What the hell is this?\" I said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1f5ff",
      "text": "He grunted as he twisted the screwdriver and I heard the screw he was working on rasp and begin to turn. \"What's it look like?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "28j3q",
      "text": "\"It looks,\" I said, carefully, \"like you're claiming that you now own this pub.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3rlhm",
      "text": "He finished the screw he was working on and went to work on the next one. \"That's about right,\" he said. \"Squatter's rights.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6uacg",
      "text": "\"You said that before. What's a squatter's right?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "49kdi",
      "text": "\"Well, you know. When buildings are left derelict, like this one, the landlord gone and no one taking care of it, it's a, you know, a blight on the neighborhood. Attracts drug users, prostitutes, gangs. Becomes an eyesore. After World War Two there were loads of these buildings, just sitting there vacant, dragging everything around them down. So families that couldn't afford housing just moved into them. It's not a crime, it's a civil violation. You can't get arrested for it, so don't worry about that. The worst they can do is force you to move out, and to do that, they need a court order. That can take months, if not years.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cq2j7",
      "text": "\"Sounds like you've done this before.\" It seemed too good to be true. I had no idea what a multistory pub was worth, but it had to be many hundreds of thousands of pounds. Could we really just move in and take it over?",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "21avv",
      "text": "\"Yeah,\" he said. \"I don't sleep in shelters if I can help it. I'm between squats at the moment, but not for long. Sleeping in shelters.\" He shrugged, the lighting bouncing around the room. \"Well, it's not for me, like I said.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8chju",
      "text": "He had the lock off now, and he withdrew a heavy new lock from his bag, lined it up with the screw holes in the door to make sure it'd fit, then filled the holes with some kind of putty and set to screwing his lock in. \"That should do it for now,\" he said. \"Once that liquid wood sets, that lock won't budge. They'll have to angle-grind it off. Later, I'll put in a few deadbolts.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1decn",
      "text": "\"Jem,\" I said. \"What the hell are you doing?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "34a1l",
      "text": "\"I'm establishing a squat,\" he said. \"Try to keep up, will you? I'm going to clean out this place, put that notice in the window, move in some beds and that, get the electricity and gas working, and I am going to live here for as long as I can. Remember what I was telling you about there being a better way to be homeless? This is it.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e1jm6",
      "text": "I swallowed. \"And what am I doing here?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1r5bq",
      "text": "\"There's loads of room,\" he said. \"And it's hard to do this alone. You've got to keep someone on the premises at all times, to tell them to bugger off if they turn up wanting to repossess the place. They can't enter the place so long as there's someone home, not without a warrant. Oh, sure, I could leave the radio on and hope that that fooled 'em but --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2ab09",
      "text": "He was going a mile a minute. I suddenly realized that he was even more nervous than I was. He'd had this place scouted out and all ready to move into, but he couldn't take it over until he found a confederate -- me. Someone had to stay home while he was out getting food and that.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "373ek",
      "text": "\"You want me to move in here? Jem --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "10b72",
      "text": "He held up both hands. \"Look, the worst thing, the absolutely worst thing, right? The worst thing that could happen is that they get a court order and evict us and we're back at the shelter. Back where you started. It might take a day, it might take years. In the meantime, what else have you got to do? Do you really want to spend the rest of your life sleeping eight to a room? Look, son, this is the chance to become a gentleman of leisure instead of, you know, a tramp. Don't you want that? 'Course you do. Of course you do!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 62, "length": 5, "style": "ITALIC" },
        { "offset": 250, "length": 5, "style": "ITALIC" },
        { "offset": 467, "length": 5, "style": "ITALIC" },
        { "offset": 511, "length": 17, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9k3g7",
      "text": "I took a step back into the dark of the stinking, shuttered pub. \"Look, mate,\" I said. \"It all sounds nice, but this is really fast --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ctfd6",
      "text": "He stood up and dusted his hands on his thighs. \"Yeah, okay, fair enough. But you wouldn't have come along if I'd told you you were going to end up living in a squat, right? I wanted you to see the place before you made up your mind. Just look at this place, son, just look at it! Think of the potential! We'll get big comfy sofas, clean up the kitchen and get the water going, stick up a Freeview antenna, find some WiFi to nick, it'll be a bloody palace. A bloody palace! Just think about what it could be like! We'll get some wood polish and bring up the wainscoting and those old snugs, shine up the chrome in the kitchen. We could have dinner parties! Christ, you should see the fridge and walk-in deep-freeze they've got in there -- we could store a year's worth of food and still have room.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 190, "length": 3, "style": "ITALIC" },
        { "offset": 466, "length": 6, "style": "ITALIC" },
        { "offset": 641, "length": 14, "style": "ITALIC" },
        { "offset": 676, "length": 3, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cmtlt",
      "text": "I teetered on the edge between my anxiety and his infectious excitement. \"I don't understand,\" I said. \"How is it possible that this won't get us banged up? Aren't we trespassing?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6ruj6",
      "text": "He shook his head. \"Not until there's a court order. Until then, we're brave homesteaders on the wooly outer edges of property law. It's a lovely place to be, mate. Places like this, it's in the public interest for us to occupy 'em. The cops might show up, but so long as you don't let 'em in and you know what to tell them, they won't do anything except make noises. Come on, what do you say? You want to be a streetkid or do you want to be an adventurer?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4faj1",
      "text": "I looked around the reeking and dark pub. Now my eyes were adjusting to the dim, I could see all the battered furnishings lurking in the shadows. It had once been a lovely place, I could see that. Nice tile work. Old wooden floors and snugs and benches. A long wooden bar with stumps where stools had been torn loose, and a broken back-mirror. I remembered how big the building had been from the outside, all the extra rooms and I wanted to explore them all, map them like a level in a game, find all their treasures and get them put to rights.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3l2k2",
      "text": "\"All right,\" I said. \"Deal. For now, anyway. But you got to promise me you won't get me arrested or cut me up and leave me in rubbish bins all over Bow.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fkjrb",
      "text": "He crossed his heart. \"Promise. I told you I was a brick around the ankles man, didn't I?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "95mgu",
      "text": "Once he had the locks on the door -- three of them, including two deadbolts that had to be slowly and painfully screwed into the jamb and door with long, sharp steel screws, a wrist-breaking task that took both of us an hour in turns -- he drew a letter out of his bag, in a sealed envelope with a first-class stamp.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2o7ci",
      "text": "\"Right,\" he said. \"This letter is addressed to me, at this address: The Three Crows pub, Bow. I'm going to nip out and find a post-box and post it. That'll get us started on proof that we live here, which'll be handy when and if the law shows up. I'll also get us some dinner. You all right with pizza?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c3jfk",
      "text": "I was well impressed. \"You've done this before.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "62jth",
      "text": "\"Never on my own, always as part of someone else's gang. But yeah, once or twice. I tell you, squatting is for kings, shelters are for tramps. Once you decide to be a king, there's no going back. So, pizza?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ad9ea",
      "text": "My stomach leapt at the word pizza. \"As the Buddha said in the kebab shop, 'make me one with everything.'\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 29, "length": 5, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3mhrd",
      "text": "He snorted and left, calling out, \"Lock up and don't let anyone in until I get back, right?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d0trc",
      "text": "\"Right!\" I called into the closing door. He'd left me with his head-torch and I strapped it on. I'd expected it to be quiet in the pub once he'd gone, but it was alive with spooky old building sounds: creaks and mysterious skittering sounds of rats in the walls. Let's not mess about: the place was stitching me up. In my head, the clittering of mouse-claws over unseen boards was the scrabbling of the local drugs lookouts -- the ones we'd heard calling to one another as we made our way to the pub -- clawing their way in throughsecret loose boards. And those creaking boards -- that was some monstrous, leathery old tramp who made this place his den, holed up in some dank corner where he was now rousing himself, getting ready to cut up and eat the interlopers who'd intruded on his territory.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dvq2q",
      "text": "I have an overactive imagination. At least I'm man enough to know it. I mean, part of me knew that there was no one else in this rotten tooth of a building. And I'd spent the morning meeting and feeding a whole gang of tramps and even they had been polite, friendly, and more scared of me (and their own shadows) than I was of them.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "egvmj",
      "text": "So I resettled the headlamp on my forehead and slowly began to explore the pub, making a conscious effort to keep my breathing even and my shoulders from tightening up around my ears.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fadmh",
      "text": "Tell you what, though: there are better ways to explore a spooky abandoned building than with a headlamp. The narrow beam of light jiggles like crazy every time you move your head the slightest, teensiest bit. The beam of light that passes right in front of your face means that you have zero peripheral vision. Every time you bounce the beam off something reflective and blind yourself, it creates a swarm of squirming green after-burns that look exactly like the hands of phantoms rising out of the walls, bent on strangling you. It is the perfect re-creation of every zombie film you've ever seen where the hero's breath rasps in and out as he walks carefully through the halls of some blood-spattered military base, waiting for a pack of growling undead biters to boil out of a doorway and tear him to gobbets and ooze.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 288, "length": 4, "style": "ITALIC" },
        { "offset": 448, "length": 7, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9sh23",
      "text": "There's only one thing worse: turning off the lamp.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6al34",
      "text": "I started off slow and careful, bent on convincing myself that I wasn't half-mad with fear. There was a large kitchen which did have huge walk-in deep-freezer, which smelt a bit off, but not totally rancid. The pipes rattled and groaned when I turned on the taps, but then the water began to flow, first in irregular bursts of brown, rusty stuff and then in a good, steady gush of clear London tap-water, the river Thames as filtered through twenty million people's kidneys, processed, dumped back into the Thames, filtered, and sent back to those thirsty kidneys. It's the crapping circle of life. Reassuring.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f1q9o",
      "text": "By now, I had a genuine case of the heebie-jeebies, and I had an idea that maybe some of the upstairs windows hadn't been quite boarded up so there might be some rooms with the light of day shining through them and chasing away the bogey-men. So I found the staircase -- which creaked like one of the Foley stages they use for horror film sound effects -- and made my noisy way up to the first floor. I didn't hang around long. Not only was it pitch black, it also smelled even worse than the ground floor. Someone had lived here and left behind a room filled with dried-out turds and the ammonia reek of old, soaked-in piss.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8u3ja",
      "text": "You want to hear something funny? Once I'd got past my total disgust, I felt a landlord's resentment at this abuse of \"my\" home. Some interloper had installed himself here and done this awful thing to my beloved home. Never mind that he'd been there first, that I hadn't known this place existed before that afternoon, and that I had pretty much broken in and claimed it as my own. I deserved this place, I was going to take care of it in a way that the animal that had crapped all over the floor could never understand.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 201, "length": 2, "style": "ITALIC" },
        { "offset": 384, "length": 8, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5jce2",
      "text": "Yeah, it's odd how quickly I went from squatter to owner in my head. But on the other hand, I remember the first time I mixed down my own edit of a Scot Colford clip and watched it spread all over the net, and how much I'd felt like that clip was mine, even though I'd taken it from someone else without asking. It's a funny old world, as the grannie in Home, Home on the Strange (Scot's first and best rom-com) used to say.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 247, "length": 4, "style": "ITALIC" },
        { "offset": 354, "length": 25, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d73d4",
      "text": "Up on the second floor, things were just as dark, but less awful. There was wax on the floor where someone had burned candles, and I kicked over a few stubs. There was a pretty horrible mattress and a litter of lager-tins in what looked like an old office -- the local estate kids' romantic getaway, I supposed -- and another room stacked high with chairs and tables, all chipped and wobbly looking. I filed that away for future reference.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bjma4",
      "text": "On the third and top story, I found some rooms whose windows were not boarded-up. These let in a weak, grayish twilight, but it was a massive relief after the pitchy dark of the rooms below. I thought I'd wait there for Jem to return. How long could it take to post a letter and get a pizza? Though, from what I'd seen of Jem, I wouldn't have been surprised if his way of posting a letter involved breaking into the central sorting office, stealing a stamp, then reverse-pickpocketing it into a letter-carrier's bag.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bch17",
      "text": "The third floor was a huge, open space: dusty and grimy, but mostly free from sign of human habitation. It was ringed with windows on all its walls, and I could imagine that it'd be a lovely penthouse someday when we'd finished doing up the place. But for now, I was more interested in the fact that the western windows were unboarded. I switched off the headlamp and examined them. They were filthy, but they looked like they might open up, admitting even more light. I yanked the painted iron handles, and pushed and tugged and grunted and rattled them until they squealed to life in a shower of dried paint and fossilized mouse turds and rust-colored dust. Slowly, painfully, I cranked the windows wide open, flooding the room with London's own dirty gray light. The fresh air was incredible, cooling and reassuring, as was the light in the room. With its help, I noted a box of candles and a stack of chairs in one corner.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1sjdq",
      "text": "I looked out the window at the bleak housing estate. It looked like a bomb site: blasted flat and partially ruined, with rotting brickwork and railings hanging free. Loads of the flats looked completely deserted, with their windows boarded up. We'd had some like that back on my estate in Bradford: places where the roof had caved in or the pipes had burst and the council had decided just to leave them empty instead of finding the money to fix them up. I didn't know much about how things were run, but I knew that the council didn't have any money and was always cutting something or other to make ends meet.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bvihk",
      "text": "If you made a biopic of my life to that point, you could call it Not Enough Money and hire someone to write a jaunty theme song called He's Skint (Yes, 'e is). It'd be a box-office smash.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 65, "length": 16, "style": "ITALIC" },
        { "offset": 135, "length": 23, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2ok0l",
      "text": "So this bomb site was pretty familiar to me. And it looked like Jem might be the first person I'd ever met who didn't have any problems with being broke. He seemed to have figured out how to live without money, which was a pretty neat trick.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "213lg",
      "text": "I peered out the window again, looking for Jem. I didn't see him (did he go to Italy for the damn pizza?), but I did spot the drugs lookouts he was talking about before. Just kids, they were, eight or nine years old, playing idle games or chatting on the balconies of the estate, sitting in doorways eating crisps, doing things that were pretty kid-like. But whenever someone new came onto the estate, they started up with their bird-calls, sending them echoing off the high towers.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2dnre",
      "text": "They began to coo and call and I thought That must be Jem. About cacking time. But when I looked out, it wasn't Jem: it was a huge, shambling man with long dreads and a black duffel-bag that he hauled as if it weighed a ton. He was wearing scuffed boots, greasy blue-jeans, a beaten wind-cheater -- he looked like a tramp. Or maybe a killer who hunted tramps and dismembered them and carried them around in a duffel bag.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 41, "length": 37, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "60bem",
      "text": "And he was headed straight for the pub.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ffa8p",
      "text": "I mean, it wasn't like there was anywhere else he could be headed for. The pub stood alone in the wasted field, like the lone tooth in a bleached skull. The man bounced when he walked, dreads shaking, arm penduluming back and forth with that weighty bag.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cg87q",
      "text": "My first thought was that this was some kind of goon sent by the owner to beat the hell out of me and toss me out. But there was no way that the landlord could know what we were up to. Jem hadn't even put up the sign yet.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dk48l",
      "text": "Then I thought he must be a dealer, alerted by the lookout. Maybe one of these loose floorboards disguised a secret stash with millions in sugar or smack or something even more exotic -- a cache of guns?",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "aa1m5",
      "text": "Then I thought he might just be someone who had got here before us, someone who lived here and did such a good job of covering up for himself when he was out that I couldn't find his nest.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3q79s",
      "text": "Then I stopped thinking because he was standing at the door, thudding rhythmically with a meaty fist, making the whole building shake. My guts squirmed with terror. I thought I'd been afraid before, but that was the nameless, almost delicious fear of something in the dark. Now I had the very pointed, very specific terror of a giant, rough-looking bloke hammering at my door. I didn't know what to do.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e6b4o",
      "text": "Seemingly of their own accord, my feet propelled me back downstairs into the pub's main room, where my headlamp was the only light. It made sense, right? After all, when someone knocks at the door, you answer it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "foqfi",
      "text": "He was still thudding at it, but then he stopped.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4cmu4",
      "text": "\"Open up, come on!\" he shouted in a rough voice. \"Haven't got all bleeding night.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8s5hk",
      "text": "I cowered in one of the snugs.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "70ar",
      "text": "\"Jem, damn it, it's me, open the goddamned door!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5aoqv",
      "text": "He knew Jem's name. That was odd.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "arl3d",
      "text": "\"Jem's not home,\" I said in my bravest voice, but it came out like a terrified squeak.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cse3q",
      "text": "There was silence from the other side of the door.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "41f68",
      "text": "\"What do you mean he's not home? I just crossed the whole pissing city. Jem, is that you? Look, mate, I don't want to play silly buggers. Open the damn door, or --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "aknt8",
      "text": "My balls shrank back up against my abdominal cavity. It was a curious sensation, and not pleasant.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d2c66",
      "text": "\"It's not Jem. He should be back soon. Sorry,\" I squeaked.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7b2da",
      "text": "\"Look, I'm the spark, all right? Jem asked me to come round and get you switched on. I've got loads of other things I could be doing, so if you want to sit in the dark, that's up to you. Your choice.\" A spark -- an electrician! Jem hadn't mentioned this, but he *had* said something about getting the electricity switched on. I'd assumed he'd meant convincing the power company to switch us on, but that wasn't really Jem's style, was it?",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "270bb",
      "text": "Cautiously, I made my way to the door and shot all the bolts and turned the lock.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4t59c",
      "text": "The man loomed over me, at least six foot six, with red-rimmed eyes. He wasn't white and he wasn't black -- but he wasn't Indian or Pakistani, either. He smelled of machine oil and sweet ganja, and his free hand was big and knuckly and spotted with oil. He pushed past me without saying a word and strode boldly into the middle of the pub.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "24gbe",
      "text": "He sniffed disapprovingly. \"Doesn't half pong, does it? My advice: scatter some fresh coffee grounds right away, that covers practically everfing. But I bet this place has a evil great extractor fan in the kitchen, you run that for a couple days and you'll get it smelling better.\" He turned to face me. \"You'll be wanting to close that door, Sunshine. Never know what sort of villains are lurking around in bad old east London.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cvpbj",
      "text": "I closed the door. I was still wearing my headlamp, and its beam showed my shaking hands as I worked the locks.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3oj4j",
      "text": "\"I'm Dodger,\" he said as he clicked on a big torch and wandered behind the bar with it, shining it underneath the counter. \"The spark.\" He stood up and headed for the kitchen. \"You ain't seen the mains-junction for this place, have you?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "17r3r",
      "text": "\"No,\" I managed, still squeaking. \"I'm Trent,\" I said. \"I'm Jem's friend.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7kk25",
      "text": "\"That's nice,\" he said. He was in the kitchen now, and I could hear him moving things, looking behind things. \"Lucky you.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "12sn1",
      "text": "\"It's got to be in the cellar,\" he said. \"Where's the door?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c3m07",
      "text": "\"I don't know,\" I said. \"I just got here.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e48in",
      "text": "\"Never mind, found it. Come here, Jem's friend.\" He was kneeling in the middle of the kitchen floor, torch in one hand, the other gripping the ring of a trapdoor set into the floor. I accidentally blinded him with my light and he let go of the ring and shielded his face. \"Careful, right? Christ, those headlamps are utter toss.\" He handed me his torch, heavy with all the batteries in it. \"Shine that where I'm working, and not in my eyes. Douse that ridiculous thing on your noggin.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c3ppo",
      "text": "I did as bid, and watched in fascination as he hauled and strained at the ring, lifting the trapdoor and letting it fall open with an ear-shattering crash. A ladder descended into the darkness of a cellar. \"Okay,\" he said, \"mission accomplished, time for a break.\" He fished in his pocket and brought out a packet of rolling papers and a baggie of something -- weed, as it turned out, strong enough to break the stink of the pub as soon as he opened the bag. \"Let's improve the air quality, right? Hold the light, that's a good lad.\" He laid the paper on the thigh of his jeans, smoothed it out, then pulled out another and carefully joined it to the first, making a double-wide paper. He sprinkled a mammoth helping of weed into the center of the paper and then quickly skinned up a spliff so neat it looked as if might be factory made. He twisted the ends, stuck it in his mouth and struck a match on the floor and lit it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "49gm6",
      "text": "He toked heavily and let out a huge cloud of fragrant smoke. \"Want some?\" he said, holding out the joint and streaming more smoke out of his nostrils.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "81tgi",
      "text": "Like one of those kids in an advert about the dangers of peer pressure, I took it and smoked it. As I inhaled, my mind was filled with paranoid fantasies about all the things the grass might be laced with: horse tranquilizers, rat poison, exotic hallucinogens, synthetic heroin. But it tasted and went down like the weed I'd smoked every now and again at school. I took one more sip of smoke, careful not to get the paper soggy, and passed it back.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1rh4t",
      "text": "He took another gigantic toke, then one more. He passed it back to me. I didn't seem to be feeling any effects, so I drew in a deep double-lungful, handed it back, then took it again once he'd done with it. We'd smoked it half-way down and he waved at me and croaked, \"Keep it, mate, gotta do some work.\" I still wasn't feeling it, which was weird, because normally I was the first one to get all silly when there was a spliff going around. Shrugging, I toked some more and held the lamp while he went down the rickety ladder. I felt pretty cool, I must say, all edgy and \"street,\" smoking this geezer's spliff in a pitch-dark squat. Just a few days before I'd been a lad from the provinces and now here I was in the great metropolis, doing crime, cutting capers, and hanging out with new mates who called themselves things like \"Dodger.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "emnuu",
      "text": "It was epic.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 7, "length": 4, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "423ht",
      "text": "Dodger was down in the cellar, and he called to me to shift the light over to the panel he'd found. He scratched his chin meditatively as he contemplated it, and I noticed that the beam of light I was shining was flickering a little, and swirling a little around the edges. Maybe it was dust in the air. Dodger wasn't complaining, so I didn't say anything.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "lo05",
      "text": "Working with the same neat efficiency he'd applied to skinning up the spliff, Dodger started to take tools out his bag. First, some kind of big meter with a pair of alligator leads he touched to different contacts on the board, working with precise, small movements. Then he nodded to himself and drew out a toolbelt that he slung around his waist, taking from it a bunch of screwdrivers and working on the plate with them in turn until the entire junction box came free of the sweating, rough brick wall. Now he brought out a spool of wire and snipped off a meter-long length, stripping the ends. He went back to work with the screwdrivers, and I squinted to see what he was working on.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d6nut",
      "text": "\"Eugh,\" he exclaimed, and reached a gloved hand into the space behind the junction box and withdrew a handful of dry, papery, furry things. \"Mummified mice,\" he called. \"Little bastards had a chew of the wires and got a surprise. Lucky thing I spotted 'em before I got the juice back on -- dry as they are, I wouldn't have been surprised if they went up in flames like old leaves.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "atjqq",
      "text": "He dropped the mummified rodents to the dirt floor of the cellar and went back to work, grunting to himself and calling on me to shift the light this way or that. There was something funny about his voice, a weird quality imparted to it by the dead space of the cellar or something, and I snorted a small giggle.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8uknj",
      "text": "\"Right,\" he said, \"one for the money, two for the show, three to get ready, aaand...\" He snapped a huge switch and the lights all through the pub blazed to light. \"Go cat go!\" I fumbled the torch and squinted against the sudden light. Then there was a loud pop and the pub was plunged back into darkness. I smelled a bonfire smell of melted plastic.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 164, "length": 10, "style": "ITALIC" },
        { "offset": 257, "length": 3, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7ek9q",
      "text": "\"Right,\" Dodger said again. \"Right. That's how it's going to be, hey? Get that light back on me, mate, this one's going to need some major work.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "b7cse",
      "text": "I groped for the torch, which had stayed on when I dropped it, and discovered that I couldn't maintain my balance. I toppled onto the filthy floor, narrowly missing a headfirst plummet down the trapdoor and ladder. I sat up gingerly, head swimming, and found the lamp. \"I think,\" I said, around a thick tongue. \"I think maybe I smoked a little too much. Just a little...\" I trailed off. My hands felt like they were encased in boxing gloves, and I could barely feel my face, and it was all brilliantly hilarious.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bbf06",
      "text": "Dodger made a rude noise. \"Christ, you're not half a little nancy, are you? Thought you northerners were supposed to be hard as nails. Just sit there and hold the light, will you?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8ka7n",
      "text": "I did, and three more times, Dodger switched on the mains and three more times there was a loud crack, smoke, and sudden darkness. The third time, there was even a little fire in the wiring, which he snuffed out with a small chemical extinguisher. This fire seemed to indicate that the job was much bigger than he'd suspected and he went to work in earnest, using a wrecker's bar to knock loose several bricks and dig deeper into the conduit that led into the cellar.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6f9uo",
      "text": "The weed pressed on my arms and legs like lead weights and I found my head drooping to my chest, my eyelids closing of their own accord. I dozed off and on in a slow, giddy, stoned stupor. The lights blazed on and popped out in an irregular rhythm as Dodger made his erratic progress, each event rousing me momentarily. I was woken up properly by Dodger thumping on the sole of my shoe with the handle of his screwdriver, reaching up from the cellar, shouting, \"Oi! Oi! Get the door, son!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "65b1l",
      "text": "I blinked my eyes and listened. Someone was clattering at the door in a jaunty rat-a-tat-a-tat, using something metallic like a key ring to beat out an uptempo ditty.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cft1v",
      "text": "I walked to the door on feet that felt like they'd grown three sizes, trying to shake the weed off my mind and limbs.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "foqb2",
      "text": "\"Who is it?\" I shouted.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bc4dn",
      "text": "\"Prince Charles,\" Jem said. \"I've come to give you a royal medal for service to England. Open the damn door, son!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c7pf5",
      "text": "I worked the locks with stupid fingers and swung the door open. It was full dark outside, which made the interior fluorescent tube lights seem as bright as the sun. Jem stepped back, nearly dropping the pizza boxes he was holding before him. \"Sorry,\" he said. \"Had some business to attend to. Took a little longer than I thought. Looks like Dodger found the place okay, though?\" He jerked his head at the lights and handed me the pizza boxes. They wafted out a smell as intoxicating as any perfume, cheesy and greasy and salty and hot and my mouth flooded with so much saliva I nearly dribbled it down my front.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "26am6",
      "text": "\"You didn't tell me anyone was coming over,\" I said, hearing a note of accusation in my voice. I wanted to say, He scared me to death. Thought he was here to murder me! But I also wanted to be, you know, hard and street and that.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 112, "length": 56, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bo524",
      "text": "Jem snorted and shut and bolted the door, shucked out of his oversize parka and draped it over a chair. Without it, he was as skinny as a broomstick, arms like toothpicks and legs like pipe-stems. \"Said I was sorry, didn't I? I thought I'd be back before Dodger showed. You don't need to be scared of him, old bean, he's a pussy-cat, Dodger is.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "g1ol",
      "text": "\"I heard that,\" Dodger shouted from the kitchen. \"Don't make me beat you like the dog you are, Jem.\" He stepped into the pub and looked around, wrinkling his nose again. \"Christ, the pong in this place just keeps coming at you in waves, like. That's a textured stench.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 252, "length": 8, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "53gm1",
      "text": "Jem waved his hand. \"We'll take care of that soon enough. Meantime, I got some coffee.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4jflm",
      "text": "Dodger nodded. \"Yeah, that'll do for a start, give it here.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4mf2o",
      "text": "Jem unzipped his backpack and handed over a paper sack of coffee grounds. Dodger popped it open, breaking the vacuum seal with a hiss and the smell of coffee was dark and warm, cutting through the piss and must smell. Dodger poured some out in his hand and sprinkled it around the pub, paying special attention to the corners and the baseboards. While he did this, Jem opened up his pizza boxes, wiped down his fingers with some sani-towels, and started to tease the slices apart, dripping gooey cheese.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "75nts",
      "text": "He offered me a wipe and I realized how grimy my hands were, like I'd been arm-deep up a cow's arse or worse, and I fastidiously scrubbed all around, up to my elbows and under my fingernails. Jem eventually plucked the wipe out of my fingers -- it was in tatters. \"You've been smoking Dodger's weed,\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ec0il",
      "text": "I nodded.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5tiol",
      "text": "\"Does funny things to you, that stuff. Smoke enough of it, you come out like Dodger. No one wants that.\" Dodger, finished with the coffee-sprinkling, balled up the empty sack and tossed it at Jem's head, beaning him right on the bonce.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "17olj",
      "text": "Jem pointed at the cooling pizzas. One was covered in mushrooms, peppers, and sweet corn. The other had pepperoni, mince beef, shrimp, and anchovies. Normally I hated both sweet corn and anchovies, but between the weed and the odd events of the day, I felt like I could try anything that night.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 183, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d0uqr",
      "text": "I tried the veggie slice first and found the sweet-corn made it just perfect, an almost-crunchy texture in the niblets that made the pizza especially great to chew. It was bursting with tangy tomato and garlic and spices -- I could taste oregano and basil, and lots more I couldn't place. It was the best-tasting thing I'd ever eaten, because I was eating it as part of an adventure. Then I tried a meat slice and that was even better, the salty anchovy and its fishy flavor rich as a good soup and perfect in a million ways. I was a normal English teenager and I'd grown up eating pizza all my life, but I'd never eaten pizza like that.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 423, "length": 11, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "o23j",
      "text": "\"Where the hell did you get this?\" I said. \"It's -- It's -- It's insane.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 65, "length": 6, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fu1me",
      "text": "Jem grinned around his own slice. \"Good, innit? Place I know, they use a wood-fired oven, make their own dough. I'd sooner starve than eat Domino's. Save up for this stuff. It ain't cheap, but this is a special occasion.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "67mln",
      "text": "Dodger rolled a slice into a tube and popped it into his mouth like a spring roll. He chewed it voraciously and swallowed hugely. \"My nipples explode with delight!\" he shouted, making us all dissolve in stupid giggles.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9uj2u",
      "text": "From there, it became a contest to see who could say the most ridiculous thing about the pizza. I tried, \"I will marry this pizza and make it my queen!\" and Jem topped it with \"You are the pizza that launched a thousand sheeps!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d1mmk",
      "text": "Before long, the food was gone and we'd picked the last strings of cheese off the greasy cardboard. I was feeling more myself now, and when Jem pulled out three tins of lager from his bag, I passed on it and washed out an unbroken pint glass and filled it with tap water, which tasted amazing, even though there was a metallic flavor from the old pipes behind it. I hadn't realized how thirsty I was.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c6thl",
      "text": "Jem and Dodger drank the beer slowly, talking about people I didn't know in other squats. From what I could work out, they had lived together somewhere else, but Jem had left -- maybe after a fight with the other squatters -- and ended up in the shelter, and that's how I'd met him. It sounded like this had all happened quite a while ago, and the sting had gone out of the old arguments.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3k3as",
      "text": "Neither of them seemed to mind that I wasn't joining in with the conversation, so I got myself another glass of water and explored the pub again, this time with the lights on. Most of the lights had burned out or were missing their bulbs, but it was still bright enough to see, and without the crazy horror-show headlamp, it was all a lot less sinister. It was also a lot less promising: there were missing floor-boards in some of the rooms (how narrowly had I missed breaking my leg?) and the stairs were sagging and splintering.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "de8dc",
      "text": "Still, I could see what the place would look like after a lot of paint and sanding, after cleaning and polishing and stuff. The pub had seen a lot of wear over the years, but it had been built with love, out of solid brick and wood, and it had been well maintained before it got all run-down and knackered.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5jeql",
      "text": "I sat down in one of the little second-story rooms, propped up against one of the walls, and tried to imagine what it would be like if with book cases and a desk and a big edit suite with some giant screens here. And then, for the second time that day, I dropped off sitting up, with my chin on my chest.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "k395",
      "text": "That was my first day in the Zeroday, as we called our pub home. Over the next two weeks, Jem and I foraged for food, scrounged furniture, did some tube-station begging, and got to painting, sanding, and refurbishing the Zeroday from roof to cellar.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bmu6r",
      "text": "Jem had a lot of friends who'd drop in, and it became clear that some of them were planning on staying. I didn't mind at first -- they were mostly older than us, and they knew a lot about sanding and painting and getting the plumbing unstuck. It's hard to say no to someone who's willing to help you scoop up ancient tramp turds and carry them off to a distant skip for disposal. Besides, having all these people around meant that Jem and I could venture out together without leaving the pub unguarded, and this was a major plus.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3k35n",
      "text": "But some of them were a bit dodgy. There was Ryan, an older guy who always wanted the first pick of the food we brought home from flash grocery skips, and took the best stuff and put it in his own bag, but never helped get the food or bring it home. He liked to stay up late drinking and smoking endless fags that filled the pub room with thick smoke, and then he'd complain about the noise when we got up in the morning.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2v7vl",
      "text": "Some of the little 'uns ones were just as bad: Sally had run away from Glasgow and hated everything about London. She claimed to be seventeen, but I thought she was probably more like fifteen. She moaned about the air, the weather, the food, the accents, the boys, the girls, the mobile reception, all of it. When she first showed up -- she came to our housewarming party, a week after we moved in, along with a whole crew of people who knew people who knew Jem -- I was a bit excited. She was very pretty, pale and round-faced, with big brown eyes, and I liked her accent. But by the time we finished dinner, I was ready to throttle her. And of course, she was one of the ones who kept showing up to stay at ours, hogging the sofas or even taking over one or another of our beds without asking. Then she'd get up in the morning and complain about the water pressure and the grime in the shower. Jem got fed-up with this and he met her on her way into the bathroom one day with an old toothbrush and a bottle of tile-cleaner and told her it was her turn to clean the shower. She didn't speak to either of us for a week, which was just fine with me.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1422s",
      "text": "\"Come on, Sunshine,\" Jem said to me one morning as I wandered into the big pub room in search of coffee. Jem had set up a coffee filter in a kind of sock that hung from a wooden stand. He brewed the lethally strong coffee in it, using beans he bought without complaint from his espresso wizard, Fyodor, paying four times what the local Co-Op asked for beans.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "513im",
      "text": "I took a cup with a nod of silent thanks and sipped it, closing my eyes while the caffeine found its way into my bloodstream and began to kick some arse.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4h9nk",
      "text": "\"What's on your agenda today, then?\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "580ls",
      "text": "I shrugged. \"Not much to do 'round here,\" I said. \"What I really want to do is get back to work with the net, but\" ... I spread my hands. \"No lappie, right?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3apbe",
      "text": "Truth be told, I'd deliberately avoided getting a new computer or borrowing someone else's. Whenever I thought about getting online, two awful feelings crashed in on the thought: first, that my mum and dad would have found a computer at the community center and filled my inboxes with pissed-off messages about me running away, and second, that I had lost my brilliant virginity-stealing Scot clip. Course, the longer I waited, the angrier the messages would be, and the harder it would be for me to remember what choices I had made in the edit. I'd neatly solved both these problems by just ignoring them, and it had been working.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7al18",
      "text": "\"Well, let's fix that, then, shall we?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5u7gu",
      "text": "\"What, do you know a skip where they chuck out old laptops?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ch50r",
      "text": "He pooched his lips. \"Trent, you'd be amazed at what you can find in skips.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e2dme",
      "text": "But it wasn't a skip -- it was a wonderland.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1lo2g",
      "text": "We got on an eastbound bus and rode it as far as it would go, for a whole hour, out and out past where the houses started to peter out in favor of bleak, crumbly industrial estates with sagging gates and chipped brickwork. They reminded me of the old workshops and factories dotted around Bradford, long-shuttered relics with sagging and missing roofs.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2mrl1",
      "text": "We were the last ones on the bus when we finally got off. The bus stop was on a small island of pavement on the shoulder of a dual carriageway. Cars rattled and honked past. There were no people around, no shops. Jem stuck his hands on his hips. \"Ready to go shopping?\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5bsfc",
      "text": "\"I suppose so. Where the hell are we?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9q4m1",
      "text": "\"Paradise,\" he said. \"Come on.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "721eh",
      "text": "He dodged across the road, vaulting the guard rail on the median. I followed, dancing around the oncoming cars. Down a winding and cracked road, we came to a low-slung warehouse with small, high windows. Jem thundered at the door with two fists.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ftpci",
      "text": "\"Hope he's home,\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ck7ik",
      "text": "I rolled my eyes. \"You mean we came all the way out here and you don't even know if the person we're here to see is even in?\" The most frustrating quirk of Jem's character was his refusal to carry a mobile phone. He might have been the last Londoner to use the red call boxes for their proper purpose (mostly, London's pay phones seemed to exist to support a thick mat of lurid cards advertising the services of prostitutes). Whenever I asked him about this, he just shrugged.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7q0a",
      "text": "\"He'll be in,\" Jem said. \"He's almost always in.\" He thumped at the door again. \"Aziz!\" he shouted, pressing his mouth up to the crack between the double-doors. \"Aziz! It's Jem!\" He pressed his eye to the crack. \"Lights are on. He's home. No fear.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fpntq",
      "text": "A moment later, the door rattled and swung open, revealing a pot-bellied Asian guy in his twenties, unshaven and rumpled in a dirty T-shirt and a pair of cut-off shorts. \"Jem?\" he said. \"Christ, boy, when are you going to get a phone?\" He turned to me. \"Who's this?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3fulq",
      "text": "\"New chum,\" he said. \"Trent, meet Aziz the Fixer. This man knows more about computers than any ten ultranerds you'll find on Tottenham Court Road, combined. He's an artist. Aziz, this is Trent, who is in need of some new kit.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fig72",
      "text": "Aziz shook my hand. His fingers were long and flexible, with calloused tips that rasped on my palm. \"Hop it then,\" he said. He turned without waiting for an answer and set off into the warehouse, leaving us to hurry after him.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "95rsa",
      "text": "The building was enormous, the size of two football pitches stitched together, with metal shelving in ranks stretching off into infinity, piled high with electronics, like the warehouse at the end of the remake of Raiders of the Lost Ark. It smelled of ozone, burnt plastic electrical insulation, and mouse piss (this last one being a smell I'd grown very familiar with while getting the Zeroday into shape). He led us through a maze of shelves, deeper and deeper, not saying anything, but occasionally grunting and jabbing a long finger in the direction of the shelves we passed, evidently pointing out something interesting. Jem nodded and made enthusiastic noises when he did this, so apparently he was seeing something I wasn't.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "975ep",
      "text": "I know a fair bit about tech, if I do say so myself. Taught myself to edit, taught myself to set up dual-boots and secure proxies to dodge the snoops. But I'd never really got down into the guts of the machine, the electronics and other gubbins. They were a complete mystery to me. Being around so many dismembered and eviscerated computers made me feel like I was getting out of my depth. I liked the feeling.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dbqhd",
      "text": "\"What is this place?\" I said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3qr5s",
      "text": "\"Aziz's place,\" Jem said. Aziz looked back over his shoulder at us and grinned like a pirate. \"Aziz is the best scrounger in all of freaking London. He's got the good stuff, mate.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2aqn3",
      "text": "We came to our destination, a cleared-away space with some long trestle-tables that served as workbenches, cluttered with semi-assembled (or disassembled?) computers. In one corner was a big four-poster bed, as unlikely as a sofa in the middle of the motorway. It was piled high with grimy pillows and bedding and even more computers. Beside it was a rolling clothes rack, the kind I'd seen in big department stores, crowded with clothes on hangers and even more clothes draped over the top.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fajfr",
      "text": "\"Right,\" Aziz said. \"What you after? Gaming? I bet it's gaming. You look like a twitchy sod.\" He seemed to be enjoying himself -- there was nothing threatening or hostile in his gruff bearing. I guessed that he didn't get much company and was glad to have it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "b8a1q",
      "text": "\"I do video editing,\" I said, feeling slightly awkward about it. It was one thing to upload a mashup and show people how hot you were, another thing to expect them to believe it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 105, "length": 4, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8gr17",
      "text": "\"Right,\" he said. \"No problems. How much you looking to spend?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fdt2t",
      "text": "Jem grinned. \"Nuffink,\" he said. \"Whatcha got?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ai82b",
      "text": "He made a fake-sour face. \"Jem, boy, you're taking liberties again.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5nv8u",
      "text": "\"Come off it, Aziz,\" he said. \"You've got more junk here than you can ever flog. And haven't I found you some of your best kit?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2lsh",
      "text": "He made his face again. \"Oh, you're a chancer. Right, okay. How's this sound, then: twelve gigahertz, sixteen gigs of RAM, four terabyte raid, two gigs of VRAM, twenty-five-inch display?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "39bt4",
      "text": "My jaw dropped. I was literally drooling, in danger of having dribble slosh down my chin. \"That sounds pretty amazing,\" I stammered.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7cjci",
      "text": "\"One thing,\" Aziz said, \"before we start. You planning on doing anything dodgy in the copyright department? No offense, but you're a mate of Jem's, so I assume you're a depraved pirate.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9nmcj",
      "text": "I looked at Jem, wondering what to make of this. He was grinning and holding up two fingers behind Aziz's back, but in a friendly way. So I said, \"You got me. I'm a depraved pirate. Incorrigible.\" I put on a medieval, dramatic voice. \"Don't blame me: blame society, for it made me the sorry soul what you see before you.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e81ua",
      "text": "Aziz smiled broadly. \"You're overdoing it. You were doing okay until you got to 'what you see before you.'\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "atdhr",
      "text": "\"Everyone's a critic.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cgoq3",
      "text": "\"There's a reason I ask,\" Aziz said. \"And that's because I figure that you'd like to keep your skinny white butt out of prison.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5ibsm",
      "text": "\"Good assumption.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7lfsn",
      "text": "\"Right. Well, if you're going to attain that objective, you'll need to be careful about the kind of kit you use. The rubbish you buy in the high street, it's got all kinds of little snitches built in that'll finger you if you ever get nicked. So what you want is to be highly selective when you assemble the gear.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 269, "length": 16, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7jvda",
      "text": "I shook my head. \"I'm not following you,\" I said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2cgqe",
      "text": "\"He's talking about trusted computing,\" Jem said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "92l0",
      "text": "\"Oh,\" I said. \"That.\" I'd heard about TC, a little. All the bits in your computer had small, secure chips on them that users couldn't alter. Your computer and operating system could use those to know which components were installed and to make sure they weren't counterfeit. Some operating systems would refuse to use dodgy parts. But like I say, I was a video editor, not a boffin. I could google up a recipe to get my computer to do something and follow it, but it wasn't like I was paying much attention. Needed to get back to my video editing, didn't I?",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5f4qk",
      "text": "\"You probably think that trusted computing is there to stop you from accidentally using fake cards and that in your computer, right?\" Aziz said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "35agq",
      "text": "\"Yeah,\" I said. \"I get the feeling you're about to tell me there's more to it.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6c72i",
      "text": "\"Top pupil,\" Aziz said. \"Have a seat, I'm going to tell you something that might just save your arse.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "24ok",
      "text": "I pulled a rolling chair up to Aziz's workbench. Jem waved at us. \"I've heard this already. Going to go have a shufty around the shelves, all right?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "duqkn",
      "text": "\"Don't mess up my filing system,\" Aziz said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dgqou",
      "text": "Jem looked pointedly at the overflowing, madcap shelves and shook his head. \"Naturally,\" he said. \"Wouldn't dream of it.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e6agb",
      "text": "Aziz sat down opposite me and grabbed a video card from the workbench. It was a big, fat thing, with two additional fans and a huge heat-sink. He grabbed an anglepoise lamp with a built-in magnifier and shone it on the card, lowering it so that I could peer through the lens. With the tip of a screwdriver, he pointed at a spot on the board.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "c293d",
      "text": "\"See that?\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "505ss",
      "text": "\"Yeah,\" I said. It looked like any of the other surface-mounted components on the circuit board: flat, black, smaller than my little fingernail. I looked closer. There was something odd about it. It didn't have any markings silk-screened on it. It wasn't just soldered onto the board, either -- there was something covering the places where the pins entered the board, clear and hard-looking, like it had been dipped in plastic. \"Something weird about that one, yeah?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1csp3",
      "text": "\"Oh yes,\" he said. \"That's the Trusted Computing snitch. It's a nice bit of engineering: triple thickness of epoxy alternating with corrosive acids that will destroy the chip if you try to remove it. Got its own little on-board processor, too, and some memory it uses to store a cryptographic certificate.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "k2nu",
      "text": "I shook my head. \"Sounds like spy stuff,\" I said. \"I had no idea.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4ocmu",
      "text": "He set the board down, pushed away the lamp. \"Here's the thing no one really gets. Ten years ago, a bunch of big companies and governments decided it would be handy if computers could be redesigned to disobey their owners, keep secrets from them. If there were secrets stored in computers that owners couldn't see, you could get up to all sorts of mischief. You could make sure that computers never copied when they weren't supposed to. You could spy on peoples' private communications. You could embed hidden codes in the video and photos and network packets they made and trace them back to individual computers.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7jonq",
      "text": "\"But keeping secrets from a computer's owner is a pretty improbable idea: imagine that I wanted to sell you a chest of drawers but I wanted to fill one of the drawers with a bunch of secret papers. I could glue and nail and cement that drawer shut, but at the end of the day, once it's at your house, you're going to be able to drill it, saw it, burn it -- you're going to get into that drawer!",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8sa2v",
      "text": "\"So we've been having this invisible arms race for the past decade, users versus manufacturers, trying to hide and recover secrets from electronics. Sometimes -- a lot of the time -- users win. This chip --\" he gestured at the video card -- \"is practically impregnable to physical attack. But there's a bug in its on-board software, and if you know the bug, you can get it to barf up its secret certificate. Once you've got that, you can forge the secret numbers it embeds in the video it processes. You can get it to pretend to be a different model of card. You can get it to save video you're not supposed to be able to save.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bhjlu",
      "text": "\"When a card like this is cracked, the manufacturer has to stop selling it, has to go back to the drawing board and find a way to fix the flaw. New versions of the operating systems are released that try to block using insecure cards in the future, but that doesn't work so well, since someone with a cracked card can always get it to impersonate a more secure, later model. Still, manufacturers regularly have to pitch out mountains of junk that some clever dick has worked out how to compromise.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "csqtt",
      "text": "I shook my head. \"You're joking. They just throw it away because someone's figured out how to get through that stupid little chip?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9aftp",
      "text": "He nodded. \"It's true. Weird, but true. You see, to get your gear certified for use with the big Hollywood studios' copyrights, you have to sign an agreement saying that your kit won't leak films onto the Internet. Once it does -- and it always does -- you have to fix it. But since the chip is soldered onto the board with self-destructing superglue, you can't really take it off, fix it, and put it back. So you have to bin it. Bad for the planet.\" He winked. \"But good for us.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 238, "length": 6, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9q4qn",
      "text": "A light went on. \"You get it all out of the bin when they chuck it?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "279su",
      "text": "\"Oh, I wish. No, most of this stuff gets chucked out in China and Vietnam and that. But whatever the local distributor has, I get. Which means that I've got the world's biggest supply of gear whose spy-chips are known to be hackable. This card here --\" he picked it up again. It was lovely and huge, the kind of graphics card that's meant to look good in the shop, all hot colors and fans that looked like they belonged on a military hovercraft. \"This card is fast as blazes. Fantastic for gaming, fantastic for cutting video and doing your own effects generation.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2t64d",
      "text": "\"And what's more, the clever people who designed it forgot to take out their testing suite before they shipped it. So there's a mountain of code in here that lets you go around the security measures, hijack the snitch-chip, and get it to give up its secrets, left over from when they were prototyping it and getting it to work. It's a stupid mistake, but you'd be surprised at how common it is. Anyway, a month ago this thing was worth eight hundred quid and now I'm finding them by the dozen in bins all over the place.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "aptij",
      "text": "It was too weird to be true. \"I don't get it: why would a store or a distributor throw it away? Wouldn't people want to buy a card that they can hack to do more? Wouldn't that make it more valuable?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 112, "length": 4, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7kk6n",
      "text": "\"Oh,\" he said. \"Right -- no, sorry, I've explained it badly. Here's what happens: you find a crack for a card and put it on the net. The entertainment bosses find out about it and have kittens. So they add something called a 'secure revocation message' to all the films and telly and that, and the next time you try to load a film or show on your box, it refuses to play, and you get an error saying that your video card is not capable of displaying this film. You take it down to the shop and they swap the card out, and the manufacturer foots the bill and chucks out your old card.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "811q4",
      "text": "\"But I thought you said you could hack the card so that they couldn't tell what model you're using?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ag0d0",
      "text": "\"Oh, I can do this. I can show you how to do it, too. But the average person doesn't know or care how to hack their card. So your villains and pirates and that get to go on merrily using their cards in ways that make Hollywood furious, but the punters and honest cits have their gear deactivated. It's a mad world, but there you have it\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 5, "length": 1, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f0o1p",
      "text": "I could remember times that Mum and Dad had had to replace their gear because of technical problems, but I'd always assumed that this was because they didn't really understand technology. Turns out it was me who didn't understand. Of course, everything I watched was pirated, which meant that it wasn't going to be sending any of these \"revocation messages.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 205, "length": 2, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "elknj",
      "text": "\"Christ,\" I said. \"Why aren't people spitting about this?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "ct6hr",
      "text": "\"Plenty of people are. But it's so easy to defeat if you know what you're doing that everyone who gets angry just solves the problem and stops being angry. Like I said, it's only the honest cits who don't even know they're getting screwed who really get hurt by this.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9ql8h",
      "text": "I wondered how many snitchy secret numbers my computer had snuck into the videos I'd released. Maybe it wasn't so bad that someone had stolen my lappie. It made me feel violated and claustrophobic to think that for years I'd been practically living inside a computer that was taking orders from somewhere else, doing things behind my back that could get me in trouble.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4b4ig",
      "text": "\"Right,\" I said. \"Let's build a computer.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8qcnk",
      "text": "It didn't work at first. Using junk parts and weird, off-brand operating systems was a lot harder than just getting a machine from the library that'd been rebuilt for give-away to local kids. But as the hours wore on, I found that I was understanding things I'd never really understood, getting under the bonnet of the machine that I used every day of my life, all day long, stripping away layers of artifice and metaphor to actually touch the bare metal and feel the electricity coursing through it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2ul59",
      "text": "There was something liberating about working with kit that was fundamentally worthless -- stuff that had started out as rubbish. Several times, I misconnected a wire and blew out a component, making eye-watering curls of smoke and melting plastic smells. But Aziz never seemed to get upset, just took anything that looked melted and tossed it into a huge steel barrel at the end of his workbench, then got replacement parts from his infinite shelves.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d9unu",
      "text": "\"It's just junk, lad, don't sweat it.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "auosu",
      "text": "Jem helped out, too, though he didn't know much more about computers than I did. But he had a good sense of space, and had lots of helpful suggestions for cramming all the bits and pieces we decided on into the laptop shell that Aziz had chosen for me. It was a little bigger and bulkier than I wanted, but that meant that there was room for more gubbins inside, which meant that I could shop longer and harder for the choicest morsels to power my new deck.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5cee0",
      "text": "Once I had all the pieces assembled and could get the computer to switch on without bursting into flames or exploding, it was time to get an operating system built and configured for it.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5j5j1",
      "text": "Aziz said, \"You say you're cool with Linux, yeah?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "64j42",
      "text": "I nodded. There were a million operating systems that were called something like \"Linux\" and if you googled too deeply, you'd find massive holy wars over which ones were and weren't Linux and what we should be calling them. I didn't pay that any attention, though. I'd been dual-booting my computers into Linux since I was a little kid. Mostly it just worked -- you took any old computer, stuck a Linux thumbdrive into it, turned it on, and let it do its thing. Sometimes it'd act weird and I'd have to look up some arcane incantation to type in to get it running again, so I knew that there was a lot going on under the bonnet that I wasn't anything like an expert in. But then again, I didn't know much about the hardware stuff, either, but it hadn't been as hard as I'd feared. It had just gone together, like Lego.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "54nki",
      "text": "But the software stuff eluded me. I had built a frankencomputer of surpassing strangeness. What's more, I wanted my operating system to work with illegal, compromised drivers for all the cards and components that would get them to lie about which cards they were, to leak protected video out the back doors I'd rudely hacked into them, to pretend to insert watermarks while doing no such thing. This wasn't about of sticking in the drive and pressing GO.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bsae2",
      "text": "\"Want a bit of advice?\" Aziz asked, round about midnight, as I cursed and rubbed my eyes and rebooted the computer for the millionth time.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6nds2",
      "text": "I slumped. Jem was even less of a software guy than I was, and had taken over Aziz's bed, taking off his shoes and curling up and snoring loudly.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6dkq9",
      "text": "\"Yeah,\" I said. \"Advice would be good.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3sle4",
      "text": "\"Your problem is, you're trying to understand it. You need to just do it.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 67, "length": 5, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2rln0",
      "text": "\"Well, thank you, Buddha, for the zen riddle. You should consider putting that on an inspirational poster. Maybe with a little Yoda: 'There is no try, there is only do.'\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2rab8",
      "text": "\"Oh, ungrateful child. I'm not talking in metaphor -- I'm being literal. You're sitting there with all those tabs open in your browser, trying to work out every aspect of Linux microkernel messaging, binary compatibility between distributions, and look at that, you're trying to read up about compilers at the same time? Mate, you are trying to get a four-year computer science degree, on your own, in one evening. You will not succeed at this.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "d78u9",
      "text": "\"It's not because you're not a smart and quick young man. I can see that you are. It's because this is impossible.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "47vkp",
      "text": "\"What you're trying to do now, you're trying to learn something about as complicated as a language. You've learned one language so far, the one we're speaking in. But you didn't wait until you'd memorized all the rules of grammar and a twenty thousand word vocabulary before you opened your gob, did you? No, you learned to talk by saying goo-goo and da-da and 'I done a pee-poo'. You made mistakes, you backtracked, went down blind alleys. You mispronounced words and got the grammar wrong. But people around you understood, and when they didn't understand what you meant, you got better at that part of speech. You let the world tell you where you needed to focus your attention, and in little and big pieces you became an expert talker, fluent in English as she is spoke the world round.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7hefl",
      "text": "\"So that's what I mean when I say you need to stop trying to understand it and just do it. Look, what you trying to do with that network card?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "4kg70",
      "text": "\"Well, I googled its part number here to see why they had to stop making it. I figured, whatever it wasn't supposed to be doing, that's what I wanted it to do. It looks like the reason Cisco had to pull this one was because you can open a raw socket and change a MAC address. I don't really know what either of those things are, so I've been reading up on them over here, and that's got me reading up on IP chaining and --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cm19r",
      "text": "\"Stop, stop! Okay. Raw sockets -- that just means that you can run programs that do their own network stuff without talking to the OS. Very useful if you want to try to, say, inject spoof traffic into a wireless network. And it's great for disguising your operating system: every OS has its own little idiosyncrasies in the way it does networks, so it's possible for someone you're talking to to tell if you're running Linux or Windows Scribble or a phone or whatever. So if there's something that won't talk to you unless you're on a locked-down phone, you can use raw sockets to pretend to be a crippled-up iPhone instead of a gloriously free frankenbox like this one.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "eodtq",
      "text": "\"MAC addresses -- those are the hardwired serial numbers on every card. They identify the manufacturer, model number, and so on. Get sent along with your requests. So if they seize your computer, they can pull the MAC address and look at all the logged traffic to a pirate site and put two and two together. You don't want that.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "dteuh",
      "text": "\"But with the right drivers, this card can generate a new, random MAC address every couple of minutes, meaning that the logs are going to see a series of new connections from exotic strangers who've never been there before. This is what you want. That's all you need to know for now. Just follow the recipes to get the drivers configured, and look up more detail as it becomes necessary. It's not like it's hard to learn new facts about networking -- just use a search engine. In the meantime, just do it.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1o15s",
      "text": "I snorted a little laugh. Between the sleep deprivation and his enthusiasm, I was getting proper excited about it all.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "14e5b",
      "text": "From there, it went much faster. I learned not to worry about the parts I didn't understand, but at Aziz's urging I started a big note-file where I made a record of all the steps I was taking. This turned out to be a life-saver: any time I got stuck or something went well pear-shaped, I could go back through those notes and find the place where I went wrong. All my life, my teachers had been on me to take notes, but this was the first time I ever saw the point. I decided to do this more often. Who knew that teachers were so clever?",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 20, "length": 4, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bq30l",
      "text": "That was when life really took off at the squat. The next week, we scouted the council estate's wireless network and got an antenna aimed at one of their access points. It was encrypted of course, and locked to registered devices so that they could keep out miscreants who'd had their network access pulled for being naughty naughty copyright pirates.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "61m2l",
      "text": "But once we had the antenna set up, it was piss easy to get the password for the network. It was written on a sheet of paper stuck to the notice board inside the estate's leisure center: \"REMEMBER: EFFECTIVE THIS MONTH, THE NETWORK PASSWORD IS CHANGING TO 'RUMPLE34PETER12ALBERT\" After all, when you need a couple thousand people to know a secret, it's hard to keep it a secret.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "48lav",
      "text": "Once we could decrypt the network traffic we were able to use Wireshark to dump and analyze all the traffic, and we quickly built up a list of all the MAC addresses in use on the system. There were thousands of them, of course: every phone had one, every computer, every game box, every set-top box for recording telly. Armed with these, we were able to use our forbidden network cards to impersonate dozens of devices at once, hopping from one MAC address to the next.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2hhu0",
      "text": "It was all brilliant, sitting in our cozy, candle-lit pub room, using our laptops, playing the latest dub-step revival music we'd pulled down from a pirate radio site, watching videos on darknet video sites, showing our screens to one another. Aziz had given me a little pocket beamer with a wireless card and we took turns grabbing it and splashing our screens on the blank wall behind the bar (we'd cleared away the broken mirror) with the projector.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "2l1n2",
      "text": "Even the housemates became easier to deal with. Ryan and Sally hooked up, which was revolting, but it didn't last long, ending with a massive row that sent Sally home to Glasgow (finally!) and convinced Ryan that he needed some \"alone time\" to get over his heartbreak. With both of them gone the Zeroday's energy changed, and it became a place where there was always someone cooking something, making something, writing a story or a song. We had all the food we could eat, and we were getting along well with our neighbors, too -- even the drug dealers and their lookouts dropped by to see what we were up to, and seemed to find the whole thing hilarious, mystifying, and altogether positive.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "afqu3",
      "text": "Dodger turned out to be an incredible chef, able to cook anything with anything. He prepared epic meals that I can still taste today: caramelized leeks with roasted stuffed peppers, potatoes roasted in duck fat and dripping with gravy. Then there was the day he made his own jellied eels. It turned my stomach at first, just the thought of it, but that didn't stop me from eating sixteen of them once I'd tasted them!",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "9ngj2",
      "text": "I never did work out what happened between Jem and Dodger and the squat they'd shared before. I could tell that they were the best of mates, though Dodger was a good five years older than us. From what I could tell though, the old squat -- Dodger still lived there -- had gone through some kind of purge after a blazing row over chores or something stupid like that. Dodger spent so much time at ours, I couldn't figure out why he didn't just move in. We had it pretty comfortable, with fifteen good bedrooms that we'd scrounged furniture for, a lovely front room, all the Internet we could eat.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "f0a23",
      "text": "I never got to know Dodger that well, but Jem seemed to include me when he talked about the Jammie Dodgers, which was the imaginary youth gang that we all belonged to. It was also the name of his favorite biscuit: the old classic round biccie filled with raspberry jam. I didn't like the biccies much, but I was proud to be a JD, really. It was nice to belong.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3mmfq",
      "text": "We hadn't seen Dodger for a few days. It had come on full summer, and the pub was sweltering. We still didn't dare take the shutters down off the bottom windows, but we'd pried them off the upper stories and had pointed a few fans out the windows upstairs, blowing the rising hot air out the building, sucking in fresh air from below. It made the Zeroday a bit cooler, just barely livable. Like hanging about in a pizza oven an hour after the restaurant had shut.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "cbh4i",
      "text": "It was three in the afternoon on a Tuesday. I was sitting in cutoff shorts and no T-shirt, staring at my laptop and trying not to think about the mountain of messages that Mum and Dad and my sister had piled up in my inbox and IM. I couldn't face opening any of them, and, of course, the longer I waited, the more angry and sad and awful it would be when I did.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "6fhkl",
      "text": "Jem cocked his head. \"Did you hear that?\" he said. My computer's fan was working triple-time in the heat, trying to force cool air over the huge graphics card I'd wrestled into the chassis at Aziz's before it melted the whole thing to molten slag. It was proper loud, and sent out a plume of hot air that shimmered in the dim.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3nta5",
      "text": "\"Hear what?\" I said. I covered the fan exhaust with a finger -- it was scalding -- and listened. There it was, the sound of a hundred tropical birds going mad with fear. It was the drugs-lookouts, and they were in a state about something. \"Maybe the coppers are raiding that sugar-shack on the eighth floor,\" I said. \"Want to go upstairs and have a peek out the window?\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "3b6q2",
      "text": "Jem didn't say anything. He'd gone pale. \"Get some trousers, shoes on, let's go,\" he said.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "fbuhh",
      "text": "I gawped at him. \"Jem?\" I said. \"What --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8sq8i",
      "text": "\"Do it,\" he snapped, and pelted up the stairs, rattling doorknobs and thumping doors, shouting, \"Get moving, get moving, coppers!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7mnvc",
      "text": "It felt like I was in a dream. For the first month after we'd claimed the Zeroday for our own, I'd lived in constant fear of a knock at the door: the coppers or the landlords come to muscle us out. Jem assured me that we couldn't be arrested for squatting -- it'd take a long court proceeding to get us out. But that didn't stop me worrying. According to Dodger, sometimes landlords would take the easy way out and send over some hard men with sticks or little coshes filled with pound coins that could shatter all the delicate bones in your face, your hands, your feet.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "a0dic",
      "text": "But you can't stay scared forever. I'd forgot that the Zeroday was anything except a utopian palace in Bow, our own little clubhouse. Now all the fear I'd left behind rushed back. I was so scared, I felt like I was moving in slow motion, like a nightmare of being chased. I ran up the stairs behind Jem, headed for my room. All the clothes I owned had come from charity shops or out of skips. I yanked on a pair of jeans. I had a good pair of trainers I'd bought at a charity shop, and I jammed my feet into them, and stuffed my socks into a pocket. I still had my laptop under my arm, and I turned around and legged it for the front door.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "7qirj",
      "text": "As I entered the room, I heard a thunderous knocking at the door and the baritone shout, \"POLICE!\" I froze to the spot. Upstairs, I could hear the sound of Jem hustling the rest of the house out the top-floor window and down the fire-stairs out back, telling them to go. The hammering grew louder.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "di8eo",
      "text": "I went back upstairs, saw Jem standing by the window, his face still pale, but composed and calm.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "e82l4",
      "text": "\"Jem!\" I said. \"What's all the panic? You said the cops wouldn't do anything to us, just order us to appear at a hearing --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bk1vb",
      "text": "He shook his head. \"That was until this week. They've got new powers to bust us for 'abstraction of electricity.' Immediate arrest and detention. Dodger told me about it -- he's gone underground. Figures that they'd like to hang him up by the thumbs.\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "1ssb0",
      "text": "Abstraction of electricity? \"What's abstraction of --\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "bi0ig",
      "text": "\"Stealing power,\" he said. \"As in, what we've been doing here for months. Go!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 74, "length": 2, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "5imtb",
      "text": "I went out the window. Downstairs, I heard the door splinter and bang open. Jem was right behind me on the fire-escape. Outside, it was a sunny summery day, hot and muggy, and the bird-calls from the drugs kids made it feel like a jungle. The fire stairs were ancient and rusted, crusted with bird-shite. I ran down them on tiptoe, noticing the patter of dry crap and dust on the ground beneath me, sure that at any moment, I'd hear a cop-voice shout, \"There they are!\" and the tromp of boots. But I touched down to the broken ground and looked up to check on Jem, who was vaulting down the steps five at a time, holding onto the shaking railing and swinging his body like a gymnast on a hobby-horse. The rest of the Zeroday's crew had already gone, disappearing into the estate, keeping behind the pub and out of sight of the men at the door.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "8gvo0",
      "text": "He hit the ground a moment later and hissed \"Run!\" He took off and streaked for the nearest estate tower. I took off after him. Behind us, I finally heard the shout: \"There!\" and then \"Stop!\"",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [
        { "offset": 45, "length": 3, "style": "ITALIC" },
        { "offset": 167, "length": 6, "style": "ITALIC" },
        { "offset": 185, "length": 5, "style": "ITALIC" }
      ],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "61au7",
      "text": "Jem planted one foot, spun, changed directions and ran off at right angles, toward the distant road, across the open ground. I'd never seen him run before, barely saw him now out of the corner of my eye, but even so, I could see that he could run, powering up like a cartoon character.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [{ "offset": 243, "length": 3, "style": "ITALIC" }],
      "entityRanges": [],
      "data": {}
    },
    {
      "key": "b7udk",
      "text": "He was leading the chase away from me. What a friend. What an idiot. Feeling like the world's biggest coward, I kept going, heading for the estate, for the door where the lock was broken, for the maze of corridors and buildings that I could disappear into.",
      "type": "unstyled",
      "depth": 0,
      "inlineStyleRanges": [],
      "entityRanges": [],
      "data": {}
    }
  ],
  "entityMap": {}
}
